{
  "conditions_to_closing": {
    "mutual_conditions_list": {
      "answer": [
        "The Company Stockholder Approval shall have been obtained.",
        "The waiting period applicable to the consummation of the Merger under the HSR Act shall have expired or been terminated.",
        "Any applicable waiting period or approvals under each applicable Competition Law related to the Merger shall have expired, been terminated, or been obtained.",
        "All consents, registrations, notices, waivers, exemptions, approvals, confirmations, clearances, permits, certificates, orders, and authorizations required to be obtained from, or delivered to, the FAA, the DOT, and the FCC in connection with the consummation of the Merger shall have been obtained or delivered.",
        "No Governmental Entity of competent jurisdiction shall have issued an Order or taken any other action enjoining or otherwise prohibiting the making or consummation of the Merger.",
        "There shall be no Law in effect which makes the Merger illegal or prohibits or otherwise prevents the consummation of the Merger."
      ],
      "clause_text": "The respective obligations of each party to consummate the Merger will be subject to the satisfaction or written waiver (where permissible) at or prior to the Effective Time of each of the following conditions: (a) The Company Stockholder Approval shall have been obtained. (b) (i) The waiting period applicable to the consummation of the Merger under the HSR Act shall have expired or been terminated, (ii) any applicable waiting period or approvals under each applicable Competition Law related to the Merger shall have expired, been terminated, or been obtained and (iii) all consents, registrations, notices, waivers, exemptions, approvals, confirmations, clearances, permits, certificates, orders, and authorizations required to be obtained from, or delivered to, the FAA, the DOT, and the FCC in connection with the consummation of the Merger shall have been obtained or delivered, as applicable. (c) (i) No Governmental Entity of competent jurisdiction shall have issued an Order or taken any other action enjoining or otherwise prohibiting the making or consummation of the Merger and (ii) there shall be no Law in effect which makes the Merger illegal or prohibits or otherwise prevents the consummation of the Merger.",
      "reference_section": "Section 6.1"
    },
    "parent_closing_conditions": {
      "answer": [
        "The representations and warranties of the Company specified in certain sections must be true and correct in all material respects as of the date of the Agreement and the Closing Date.",
        "The Company must have performed and complied in all material respects with its agreements and covenants under the Agreement.",
        "No Company Material Adverse Effect shall have occurred since the date of the Agreement.",
        "Parent must receive a certificate from the Company, executed by an executive officer, certifying that the conditions regarding representations, warranties, and covenants have been satisfied."
      ],
      "clause_text": "The obligations of Parent and Merger Sub to consummate the Merger will be subject to the satisfaction or written waiver (where permissible) at or prior to the Effective Time of each of the following conditions: (a) (i) The representations and warranties of the Company contained in Section 3.1, Section 3.2(d), Section 3.3, Section 3.9, Section 3.29 and Section 3.30 of this Agreement shall be true and correct in all material respects as of the date of this Agreement and as of the Closing Date with the same force and effect as if made on and as of such date, except for any representation and warranty that is expressly made as of a specific date or time (which needs only be true and correct in all material respects as of such date or time), (ii) the representations and warranties of the Company contained in the first sentence of Section 3.2(a), the first sentence of Section 3.2(b), Section 3.2(c), Section 3.2(e) and the first and second sentences of Section 3.33 shall be true and correct in all respects (except for de minimis deviations) as of the date of this Agreement and as of the Closing Date with the same force and effect as if made on and as of such date, except for any representation and warranty that is expressly made as of a specific date or time (which needs only be true and correct in all respects (except for de minimis deviations) as of such date or time) and (iii) all other representations and warranties of the Company contained in this Agreement (without giving effect to any references to any Company Material Adverse Effect or materiality qualifications and other qualifications based upon the concept of materiality or similar phrases contained therein, other than the representations set forth in Section 3.11(b) or in the term 'Company Material Contract') shall be true and correct in all respects as of the date of this Agreement and as of the Closing Date with the same force and effect as if made on and as of such date (other than any representation and warranty that is expressly made as of a specific date or time, which needs only be true and correct in all respects as of such date or time), except where the failure of such representations and warranties in this clause (iii) to be so true and correct has not had and would not reasonably be expected to have, individually or in the aggregate with all other such failures to be true or correct, a Company Material Adverse Effect. (b) The Company shall have performed and complied in all material respects with the agreements and covenants to be performed or complied with by it under this Agreement at or prior to the Closing, or any breach or failure to do so shall have been cured. (c) Since the date of this Agreement, there shall not have occurred a Company Material Adverse Effect. (d) Parent shall have received a certificate of the Company, executed by an executive officer of the Company, dated as of the Closing Date, certifying that the conditions set forth in subsections (a) and (b) of this Section 6.2 have been satisfied.",
      "reference_section": "Section 6.2"
    },
    "company_closing_conditions": {
      "answer": [
        "The representations and warranties of Parent and Merger Sub must be true and correct in all material respects as of the date of the Agreement and as of the Closing Date.",
        "All other representations and warranties of Parent and Merger Sub must be true and correct in all respects, except where failure to be true and correct would not have a Parent Material Adverse Effect.",
        "Parent and Merger Sub must have performed and complied in all material respects with the agreements and covenants under the Agreement.",
        "The Company must receive a certificate from Parent, executed by an executive officer, certifying satisfaction of conditions related to representations, warranties, agreements, and covenants."
      ],
      "clause_text": "The obligation of the Company to consummate the Merger will be subject to the satisfaction or (to the extent permitted by applicable Law) written waiver (where permissible) at or prior to the Effective Time of each of the following conditions: (a) (i) The representations and warranties of Parent and Merger Sub contained in Section 4.1, Section 4.2 and Section 4.11 of this Agreement shall be true and correct in all material respects as of the date of this Agreement and as of the Closing Date with the same force and effect as if made on and as of such date, except for any representation and warranty that is expressly made as of a specific date or time (which needs only be true and correct in all material respects as of such date or time) and (ii) all other representations and warranties of Parent and Merger Sub contained in this Agreement (without giving effect to any references to any Parent Material Adverse Effect or materiality qualifications and other qualifications based upon the concept of materiality or similar phrases contained therein) shall be true and correct in all respects as of the date of this Agreement and as of the Closing Date with the same force and effect as if made on and as of such date (other than any representation and warranty that is expressly made as of a specific date or time, which needs only be true and correct in all respects as of such date or time), except where the failure of such representations and warranties in this clause (ii) to be so true and correct has not had and would not reasonably be expected to have, individually or in the aggregate with all other such failures to be true or correct, a Parent Material Adverse Effect. (b) Each of Parent and Merger Sub shall have performed and complied in all material respects with the agreements and covenants to be performed or complied with by it under this Agreement at or prior to the Closing, or any breach or failure to do so shall have been cured. (c) The Company shall have received a certificate of Parent, executed by an executive officer of Parent, dated as of the Closing Date, certifying that the conditions set forth in subsections (a) and (b) of this Section 6.3 have been satisfied.",
      "reference_section": "Section 6.3"
    },
    "target_shareholder_approval_required": {
      "answer": true,
      "clause_text": "The respective obligations of each party to consummate the Merger will be subject to the satisfaction or written waiver (where permissible) at or prior to the Effective Time of each of the following conditions: (a) The Company Stockholder Approval shall have been obtained.",
      "reference_section": "Section 6.1 (a)"
    },
    "target_shareholder_approval_threshold": {
      "answer": "majority of the voting power of the outstanding shares of the Company Common Stock entitled to vote thereon",
      "clause_text": "Assuming the accuracy of the representation in the second sentence of Section 4.6 hereof, the affirmative vote or written consent of the holders of Shares representing a majority of the voting power of the outstanding shares of the Company Common Stock entitled to vote thereon (the 'Company Required Vote') is the only vote required of the holders of any class of capital stock of the Company to adopt this Agreement (the 'Company Stockholder Approval').",
      "reference_section": "Section 3.29"
    },
    "hsr_clearance_required": {
      "answer": true,
      "clause_text": "The waiting period applicable to the consummation of the Merger under the HSR Act ... shall have expired or been terminated.",
      "reference_section": "Section 6.1"
    },
    "other_customary_conditions": {
      "answer": [
        "The Company Stockholder Approval shall have been obtained.",
        "The waiting period applicable to the consummation of the Merger under the HSR Act shall have expired or been terminated.",
        "All consents, registrations, notices, waivers, exemptions, approvals, confirmations, clearances, permits, certificates, orders, and authorizations required to be obtained from, or delivered to, the FAA, the DOT, and the FCC in connection with the consummation of the Merger shall have been obtained or delivered.",
        "No Governmental Entity of competent jurisdiction shall have issued an Order or taken any other action enjoining or otherwise prohibiting the making or consummation of the Merger.",
        "There shall be no Law in effect which makes the Merger illegal or prohibits or otherwise prevents the consummation of the Merger."
      ],
      "clause_text": "The respective obligations of each party to consummate the Merger will be subject to the satisfaction or written waiver (where permissible) at or prior to the Effective Time of each of the following conditions: (a) The Company Stockholder Approval shall have been obtained. (b) (i) The waiting period applicable to the consummation of the Merger under the HSR Act shall have expired or been terminated, (ii) any applicable waiting period or approvals under each applicable Competition Law related to the Merger shall have expired, been terminated, or been obtained and (iii) all consents, registrations, notices, waivers, exemptions, approvals, confirmations, clearances, permits, certificates, orders, and authorizations required to be obtained from, or delivered to, the FAA, the DOT, and the FCC in connection with the consummation of the Merger shall have been obtained or delivered, as applicable. (c) (i) No Governmental Entity of competent jurisdiction shall have issued an Order or taken any other action enjoining or otherwise prohibiting the making or consummation of the Merger and (ii) there shall be no Law in effect which makes the Merger illegal or prohibits or otherwise prevents the consummation of the Merger.",
      "reference_section": "Section 6.1"
    },
    "financial_conditions_minimum_cash_threshold": {
      "answer": "Not found",
      "clause_text": "",
      "reference_section": ""
    },
    "financial_conditions_maximum_net_debt": {
      "answer": "Not found",
      "clause_text": "",
      "reference_section": ""
    },
    "financial_conditions_minimum_any_condition": {
      "answer": "Not found",
      "clause_text": "",
      "reference_section": ""
    },
    "tax_conditions_tax_opinion_required": {
      "answer": "Not found",
      "clause_text": "",
      "reference_section": ""
    }
  },
  "material_adverse_effect": {
    "mae_carveout": {
      "mae_carveout_general_economic_conditions_included": {
        "answer": true,
        "clause_text": "Company Material Adverse Effect means any change, event, circumstance, development, condition, occurrence or effect that...; provided, however, that none of the following will be deemed in themselves... (vi) the taking of any action expressly contemplated by this Agreement or at Parent’s or Merger Sub’s request;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_general_economic_conditions_explanation": {
        "answer": "Adverse effects resulting from general economic conditions are excluded from the definition of Material Adverse Effect.",
        "clause_text": "provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute, and that none of the following will be taken into account in determining whether there has been or will be, a Company Material Adverse Effect: (i) any development in general economic conditions, or in securities, credit or financial markets, including changes in interest rates and changes in exchange rates, in the United States or any other country or region in the world in which the Company conducts business or any industry-wide development generally affecting airline companies;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_industry_conditions_included": {
        "answer": true,
        "clause_text": "provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute, and that none of the following will be taken into account in determining whether there has been or will be, a Company Material Adverse Effect: (i) any development in general economic conditions, or in securities, credit or financial markets, including changes in interest rates and changes in exchange rates, in the United States or any other country or region in the world in which the Company conducts business or any industry-wide development generally affecting airline companies;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_industry_conditions_explanation": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "mae_carveout_stock_price_changes_included": {
        "answer": true,
        "clause_text": "any change in the market price or trading volume, or the downgrade in rating, of the Company’s securities (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration into determining whether there has been, a Company Material Adverse Effect);",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_stock_price_changes_explanation": {
        "answer": "Changes in the market price or trading volume of the Company’s securities are excluded from the definition of a Company Material Adverse Effect.",
        "clause_text": "any change in the market price or trading volume, or the downgrade in rating, of the Company’s securities (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration into determining whether there has been, a Company Material Adverse Effect);",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_credit_rating_changes_included": {
        "answer": true,
        "clause_text": "any change in the market price or trading volume, or the downgrade in rating, of the Company’s securities (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration into determining whether there has been, a Company Material Adverse Effect);",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_credit_rating_changes_explanation": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "mae_carveout_legal_or_regulatory_changes_included": {
        "answer": true,
        "clause_text": "provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute, and that none of the following will be taken into account in determining whether there has been or will be, a Company Material Adverse Effect: ... (ii) any change in GAAP or any change in applicable Laws applicable to the operation of the business of the Company;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_legal_or_regulatory_changes_explanation": {
        "answer": "any change in GAAP or any change in applicable Laws applicable to the operation of the business of the Company",
        "clause_text": "any change in GAAP or any change in applicable Laws applicable to the operation of the business of the Company;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_force_majeure_events_included": {
        "answer": true,
        "clause_text": "provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute, and that none of the following will be taken into account in determining whether there has been or will be, a Company Material Adverse Effect: ... (iv) acts of war, outbreak or escalation of hostilities, terrorism or sabotage, or other changes in geopolitical conditions, earthquakes, hurricanes, tsunamis, tornados, floods, mudslides, wild fires or other natural disasters, any epidemic, pandemic, outbreak of illness or other public health event ...",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_force_majeure_events_explanation": {
        "answer": "Acts of God, natural disasters, or weather-related events are excluded from the definition of Material Adverse Effect.",
        "clause_text": "acts of war, outbreak or escalation of hostilities, terrorism or sabotage, or other changes in geopolitical conditions, earthquakes, hurricanes, tsunamis, tornados, floods, mudslides, wild fires or other natural disasters, any epidemic, pandemic, outbreak of illness or other public health event (including, for the avoidance of doubt, COVID-19 and impact of COVID-19 on the Company) and other similar events in the United States or any other country or region in the world in which the Company conducts business;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_political_events_or_war_included": {
        "answer": true,
        "clause_text": "provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute, and that none of the following will be taken into account in determining whether there has been or will be, a Company Material Adverse Effect: ... (iv) acts of war, outbreak or escalation of hostilities, terrorism or sabotage, or other changes in geopolitical conditions...",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_political_events_or_war_explanation": {
        "answer": "acts of war, outbreak or escalation of hostilities, terrorism or sabotage, or other changes in geopolitical conditions",
        "clause_text": "acts of war, outbreak or escalation of hostilities, terrorism or sabotage, or other changes in geopolitical conditions",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_pandemic_health_events_included": {
        "answer": true,
        "clause_text": "Company Material Adverse Effect means any change, event, circumstance, development, condition, occurrence or effect that...; provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute... a Company Material Adverse Effect:... any epidemic, pandemic, outbreak of illness or other public health event (including, for the avoidance of doubt, COVID-19 and impact of COVID-19 on the Company)...",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_pandemic_health_events_explanation": {
        "answer": "epidemic, pandemic, outbreak of illness or other public health event (including, for the avoidance of doubt, COVID-19 and impact of COVID-19 on the Company) and other similar events in the United States or any other country or region in the world in which the Company conducts business",
        "clause_text": "any epidemic, pandemic, outbreak of illness or other public health event (including, for the avoidance of doubt, COVID-19 and impact of COVID-19 on the Company) and other similar events in the United States or any other country or region in the world in which the Company conducts business",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_agreement_compliance_effects_included": {
        "answer": true,
        "clause_text": "any change resulting from the announcement or pendency of the transactions contemplated by this Agreement, including the Merger (it being understood that this clause (iii) shall not apply to any representation, warranty, covenant or agreement of the Company herein that is expressly intended to address the consequences of the execution, delivery or performance of this Agreement or the consummation of the transactions contemplated hereby);",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_agreement_compliance_effects_explanation": {
        "answer": "The effects resulting from the announcement or pendency of the transactions contemplated by the Agreement, including the Merger, are excluded from the definition of a Company Material Adverse Effect.",
        "clause_text": "any change resulting from the announcement or pendency of the transactions contemplated by this Agreement, including the Merger (it being understood that this clause (iii) shall not apply to any representation, warranty, covenant or agreement of the Company herein that is expressly intended to address the consequences of the execution, delivery or performance of this Agreement or the consummation of the transactions contemplated hereby);",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_parent_actions_included": {
        "answer": true,
        "clause_text": "The taking of any action expressly contemplated by this Agreement or at Parent’s or Merger Sub’s request;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_parent_actions_explanation": {
        "answer": "The Company shall not be deemed to have suffered a Material Adverse Effect as a result of actions it was instructed or requested to take by the Parent.",
        "clause_text": "Company Material Adverse Effect means any change, event, circumstance, development, condition, occurrence or effect that... (vi) the taking of any action expressly contemplated by this Agreement or at Parent’s or Merger Sub’s request;",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_projections_miss_included": {
        "answer": true,
        "clause_text": "any failure by the Company to meet any internal or published (including analyst) projections, expectations, forecasts or predictions in respect of the Company’s revenue, earnings or other financial performance or results of operations (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect);",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_projections_miss_explanation": {
        "answer": "any failure by the Company to meet any internal or published (including analyst) projections, expectations, forecasts or predictions in respect of the Company’s revenue, earnings or other financial performance or results of operations (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect)",
        "clause_text": "any failure by the Company to meet any internal or published (including analyst) projections, expectations, forecasts or predictions in respect of the Company’s revenue, earnings or other financial performance or results of operations (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect)",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_other_custom_items_present": {
        "answer": false,
        "clause_text": "Company Material Adverse Effect means any change, event, circumstance, development, condition, occurrence or effect that (a) has had, or would reasonably be expected to have, individually or in the aggregate, a material adverse effect on the business, financial condition, assets, liabilities or results of operations of the Company Group, taken as a whole, or (b) prevents, or materially delays, the ability of the Company to consummate the transactions contemplated by this Agreement; provided, however, that none of the following will be deemed in themselves, either alone or in combination, to constitute, and that none of the following will be taken into account in determining whether there has been or will be, a Company Material Adverse Effect: (i) any development in general economic conditions, or in securities, credit or financial markets, including changes in interest rates and changes in exchange rates, in the United States or any other country or region in the world in which the Company conducts business or any industry-wide development generally affecting airline companies; (ii) any change in GAAP or any change in applicable Laws applicable to the operation of the business of the Company; (iii) any change resulting from the announcement or pendency of the transactions contemplated by this Agreement, including the Merger (it being understood that this clause (iii) shall not apply to any representation, warranty, covenant or agreement of the Company herein that is expressly intended to address the consequences of the execution, delivery or performance of this Agreement or the consummation of the transactions contemplated hereby); (iv) acts of war, outbreak or escalation of hostilities, terrorism or sabotage, or other changes in geopolitical conditions, earthquakes, hurricanes, tsunamis, tornados, floods, mudslides, wild fires or other natural disasters, any epidemic, pandemic, outbreak of illness or other public health event (including, for the avoidance of doubt, COVID-19 and impact of COVID-19 on the Company) and other similar events in the United States or any other country or region in the world in which the Company conducts business; (v) any failure by the Company to meet any internal or published (including analyst) projections, expectations, forecasts or predictions in respect of the Company’s revenue, earnings or other financial performance or results of operations (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect); (vi) the taking of any action expressly contemplated by this Agreement or at Parent’s or Merger Sub’s request; or (vii) any change in the market price or trading volume, or the downgrade in rating, of the Company’s securities (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration into determining whether there has been, a Company Material Adverse Effect); provided, further, that the effects or changes set forth in the foregoing clauses (i), (ii) and (iv) shall be taken into account in determining whether there has occurred a Company Material Adverse Effect only to the extent such developments have, individually or in the aggregate, a disproportionate impact on the Company relative to other companies in the airline industry, in which case only the incremental disproportionate impact may be taken into account.",
        "reference_section": "Section 8.4"
      },
      "mae_carveout_other_custom_items": {
        "answer": "Not Found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "mae_carveback": {
      "mae_carveback_disproportionate_effects_included": {
        "answer": true,
        "clause_text": "provided, further, that the effects or changes set forth in the foregoing clauses (i), (ii) and (iv) shall be taken into account in determining whether there has occurred a Company Material Adverse Effect only to the extent such developments have, individually or in the aggregate, a disproportionate impact on the Company relative to other companies in the airline industry, in which case only the incremental disproportionate impact may be taken into account.",
        "reference_section": "Section 8.4"
      },
      "mae_carveback_disproportionate_effects_explanation": {
        "answer": "The MAE definition includes a carve-back stating that carve-outs do not apply if such events disproportionately affect the Company relative to others in its industry.",
        "clause_text": "provided, further, that the effects or changes set forth in the foregoing clauses (i), (ii) and (iv) shall be taken into account in determining whether there has occurred a Company Material Adverse Effect only to the extent such developments have, individually or in the aggregate, a disproportionate impact on the Company relative to other companies in the airline industry, in which case only the incremental disproportionate impact may be taken into account.",
        "reference_section": "Section 8.4"
      },
      "mae_carveback_additional_exceptions_included": {
        "answer": true,
        "clause_text": "provided, further, that the effects or changes set forth in the foregoing clauses (i), (ii) and (iv) shall be taken into account in determining whether there has occurred a Company Material Adverse Effect only to the extent such developments have, individually or in the aggregate, a disproportionate impact on the Company relative to other companies in the airline industry, in which case only the incremental disproportionate impact may be taken into account.",
        "reference_section": "Section 8.4"
      },
      "mae_carveback_additional_exceptions_explanation": {
        "answer": [
          "The effects or changes set forth in clauses (i), (ii), and (iv) shall be taken into account in determining whether there has occurred a Company Material Adverse Effect only to the extent such developments have, individually or in the aggregate, a disproportionate impact on the Company relative to other companies in the airline industry, in which case only the incremental disproportionate impact may be taken into account.",
          "Any failure by the Company to meet any internal or published projections, expectations, forecasts or predictions in respect of the Company’s revenue, earnings or other financial performance or results of operations (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect).",
          "Any change in the market price or trading volume, or the downgrade in rating, of the Company’s securities (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration into determining whether there has been, a Company Material Adverse Effect)."
        ],
        "clause_text": "The effects or changes set forth in the foregoing clauses (i), (ii) and (iv) shall be taken into account in determining whether there has occurred a Company Material Adverse Effect only to the extent such developments have, individually or in the aggregate, a disproportionate impact on the Company relative to other companies in the airline industry, in which case only the incremental disproportionate impact may be taken into account.",
        "reference_section": "Section 8.4"
      },
      "mae_carveback_causation_based_analysis_included": {
        "answer": true,
        "clause_text": "any failure by the Company to meet any internal or published (including analyst) projections, expectations, forecasts or predictions in respect of the Company’s revenue, earnings or other financial performance or results of operations (it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect);",
        "reference_section": "Section 8.4"
      },
      "mae_carveback_causation_based_analysis_explanation": {
        "answer": "The facts or occurrences giving rise to an excluded event may still be taken into account in determining whether a Material Adverse Effect has occurred.",
        "clause_text": "it being understood that the underlying facts and circumstances giving rise to such event may be deemed to constitute, and may be taken into consideration in determining whether there has been, a Company Material Adverse Effect",
        "reference_section": "Section 8.4"
      }
    }
  },
  "non_solicitation": {
    "no_shop_clause": {
      "no_shop_clause_included": {
        "answer": true,
        "clause_text": "Except as otherwise permitted by this Section 5.3, the Company will, and will cause its directors, officers and employees to, and will instruct its other Representatives to: (i) (A) immediately cease and cause to be terminated any solicitation, discussions or negotiations with any Persons that may be ongoing with respect to any Acquisition Proposal, or any inquiry, expression of interest, proposal, discussions, negotiations or offer that would reasonably be expected to lead to an Acquisition Proposal, (B) promptly inform such Persons of the obligations set forth in this Section 5.3...",
        "reference_section": "Section 5.3 (a)"
      },
      "no_shop_claus_explanation": {
        "answer": "The Company is restricted from soliciting, initiating, or encouraging any Acquisition Proposal and must cease any ongoing discussions or negotiations with third parties regarding such proposals.",
        "clause_text": "Except as otherwise permitted by this Section 5.3, the Company will, and will cause its directors, officers and employees to, and will instruct its other Representatives to: (i) (A) immediately cease and cause to be terminated any solicitation, discussions or negotiations with any Persons that may be ongoing with respect to any Acquisition Proposal, or any inquiry, expression of interest, proposal, discussions, negotiations or offer that would reasonably be expected to lead to an Acquisition Proposal, (B) promptly inform such Persons of the obligations set forth in this Section 5.3, (C) promptly instruct each Person that has previously executed a confidentiality agreement in connection with such Person's consideration of an Acquisition Proposal to return to the Company or destroy any non-public information previously furnished to such Person or to any Person's Representatives by or on behalf of the Company and (D) promptly terminate all physical and electronic data room access previously granted to such Person and its Representatives; and (ii) not, directly or indirectly: (A) solicit, initiate, knowingly encourage or knowingly facilitate any inquiry, expression of interest, proposal or offer that constitutes or would reasonably be expected to lead to an Acquisition Proposal, (B) participate in any discussions or negotiations relating to any Acquisition Proposal with any Person other than Parent and Merger Sub, (C) furnish to any Person other than Parent and Merger any non-public information in connection with an Acquisition Proposal or that would reasonably be expected to lead to an Acquisition Proposal, (D) enter into any agreement, letter of intent, memorandum of understanding, agreement in principle, acquisition agreement, merger agreement, option or other similar Contract providing for or otherwise relating to any Acquisition Proposal (other than an Acceptable Confidentiality Agreement in accordance with the terms of this Agreement) or that is intended to result in, or would reasonably be expected to lead to, any Acquisition Proposal (each, an \"Alternative Acquisition Agreement\") or (E) submit any Acquisition Proposal or any matter related thereto to the vote of the stockholders of the Company.",
        "reference_section": "Section 5.3 (a)"
      }
    },
    "notice_of_competing_offer": {
      "notice_of_competing_offer_included": {
        "answer": true,
        "clause_text": "From and after the date of this Agreement, the Company will promptly (and in any event within 24 hours) (i) notify Parent of (A) any inquiry, proposal or offer (whether written or oral) relating to an Acquisition Proposal (including any material modification thereto) that is received by the Company or any of its respective Representatives from any Person (other than Parent and Merger Sub).",
        "reference_section": "Section 5.3 (c)"
      },
      "notice_of_competing_offer_explanation": {
        "answer": "The Company is required to notify the Parent of any Acquisition Proposal within 24 hours, including the identity of the person making the proposal and providing an unredacted copy of any written proposal.",
        "clause_text": "From and after the date of this Agreement, the Company will promptly (and in any event within 24 hours) (i) notify Parent of (A) any inquiry, proposal or offer (whether written or oral) relating to an Acquisition Proposal (including any material modification thereto) that is received by the Company or any of its respective Representatives from any Person (other than Parent and Merger Sub) or (B) any inquiries, requests, proposals or offers received by, or any discussions or negotiations sought to be initiated or continued with the Company or any of its respective Representatives concerning an Acquisition Proposal and (ii) disclose to Parent the identity of such person making, and provide an unredacted copy of, any such written Acquisition Proposal or any such inquiry, expression of interest, request, proposal or offer made in writing (or, if made orally, a reasonably detailed description of such Acquisition Proposal, inquiry, request, proposal or offer).",
        "reference_section": "Section 5.3 (c)"
      }
    },
    "ongoing_update": {
      "ongoing_update_included": {
        "answer": true,
        "clause_text": "The Company will, in person or by telephone, keep Parent reasonably informed of the status and terms (including with respect to any change in price or other material amendments) of any such Acquisition Proposal or other inquiry, request, offer or proposal concerning an Acquisition Proposal.",
        "reference_section": "Section 5.3 (c)"
      },
      "ongoing_update_explanation": {
        "answer": "The Company is obligated to promptly notify Parent of any inquiry, proposal, or offer relating to an Acquisition Proposal within 24 hours, including any material modifications, and provide copies of all relevant documents.",
        "clause_text": "From and after the date of this Agreement, the Company will promptly (and in any event within 24 hours) (i) notify Parent of (A) any inquiry, proposal or offer (whether written or oral) relating to an Acquisition Proposal (including any material modification thereto) that is received by the Company or any of its respective Representatives from any Person (other than Parent and Merger Sub) or (B) any inquiries, requests, proposals or offers received by, or any discussions or negotiations sought to be initiated or continued with the Company or any of its respective Representatives concerning an Acquisition Proposal and (ii) disclose to Parent the identity of such person making, and provide an unredacted copy of, any such written Acquisition Proposal or any such inquiry, expression of interest, request, proposal or offer made in writing (or, if made orally, a reasonably detailed description of such Acquisition Proposal, inquiry, request, proposal or offer).",
        "reference_section": "Section 5.3 (c)"
      }
    },
    "superior_proposal_engagement": {
      "superior_proposal_engagement_included": {
        "answer": true,
        "clause_text": "if at any time on or after the date of this Agreement until the earlier of (1) receipt of the Company Stockholder Approval and (2) the termination of this Agreement in accordance with its terms, (i) the Company has received a bona fide written Acquisition Proposal from a third party, (ii) such Acquisition Proposal did not result from a breach of this Section 5.3, (iii) the Company Board determines in good faith, after consultation with its financial advisor and outside counsel, that such Acquisition Proposal constitutes or could reasonably be likely to lead to a Superior Proposal, (iv) after consultation with its outside counsel, the Company Board determines in good faith that the failure to take such actions would reasonably be expected to be inconsistent with the fiduciary duties owed by the directors of the Company to the stockholders of the Company under applicable Law and (v) the Company receives from such Person an executed Acceptable Confidentiality Agreement, then the Company may take the following actions: (A) furnish information with respect to the Company to the Person making such Acquisition Proposal pursuant to one or more Acceptable Confidentiality Agreements and/or (B) participate in discussions or negotiations with the Person making such Acquisition Proposal regarding such Acquisition Proposal; provided, that (x) the Company provides written notice to Parent of the determination referenced in clause (iii) and clause (iv) promptly (and in any event within 24 hours) and (y) the Company will provide to Parent in writing any information concerning the Company provided to such other Person which was not previously provided to Parent or the Parent Representatives prior to or substantially concurrently with the time it is provided to such Person.",
        "reference_section": "Section 5.3 (d)"
      },
      "superior_proposal_engagement_explanation": {
        "answer": "The Company is authorized to engage with third parties if a Superior Proposal is received, provided certain conditions are met.",
        "clause_text": "Notwithstanding anything to the contrary contained in Section 5.3(a), if at any time on or after the date of this Agreement until the earlier of (1) receipt of the Company Stockholder Approval and (2) the termination of this Agreement in accordance with its terms, (i) the Company has received a bona fide written Acquisition Proposal from a third party, (ii) such Acquisition Proposal did not result from a breach of this Section 5.3, (iii) the Company Board determines in good faith, after consultation with its financial advisor and outside counsel, that such Acquisition Proposal constitutes or could reasonably be likely to lead to a Superior Proposal, (iv) after consultation with its outside counsel, the Company Board determines in good faith that the failure to take such actions would reasonably be expected to be inconsistent with the fiduciary duties owed by the directors of the Company to the stockholders of the Company under applicable Law and (v) the Company receives from such Person an executed Acceptable Confidentiality Agreement, then the Company may take the following actions: (A) furnish information with respect to the Company to the Person making such Acquisition Proposal pursuant to one or more Acceptable Confidentiality Agreements and/or (B) participate in discussions or negotiations with the Person making such Acquisition Proposal regarding such Acquisition Proposal.",
        "reference_section": "Section 5.3 (d)"
      }
    },
    "match_right": {
      "match_right_initial_included": {
        "answer": true,
        "clause_text": "prior to effecting such Change of Board Recommendation or terminating this Agreement to enter into an Alternative Acquisition Agreement with respect to such Superior Proposal, the Company will, during the Notice Period, negotiate with Parent in good faith (to the extent Parent desires to negotiate) to make such adjustments in the terms and conditions of this Agreement so that such Acquisition Proposal ceases to constitute a Superior Proposal;",
        "reference_section": "Section 5.3 (f)"
      },
      "match_right_initial_explanation": {
        "answer": "The Company must provide prior written notice to Parent, at least four (4) Business Days in advance (the 'Notice Period'), of the Company's intention to take such action with respect to such Superior Proposal, which notice will specify the material terms and conditions of such Superior Proposal, and the Company has contemporaneously provided a copy of all relevant proposed transaction agreements with the party making such Superior Proposal.",
        "clause_text": "The Company has provided prior written notice to Parent, at least four (4) Business Days in advance (the 'Notice Period'), of the Company's intention to take such action with respect to such Superior Proposal, which notice will specify the material terms and conditions of such Superior Proposal (including all of the information that is specified in Section 5.3(c)), and the Company has contemporaneously provided a copy of all relevant proposed transaction agreements with the party making such Superior Proposal.",
        "reference_section": "Section 5.3 (f)"
      },
      "match_right_amended_included": {
        "answer": true,
        "clause_text": "provided, that in the event of any material revisions to the Superior Proposal, the Company will be required to deliver a new written notice to Parent and to comply with the requirements of this Section 5.3(f) with respect to such new written notice; provided, further, that the Notice Period for any subsequent notice will be shortened from four (4) Business Days to two (2) Business Days;",
        "reference_section": "Section 5.3 (f)"
      },
      "match_right_amended_explanation": {
        "answer": "The agreement permits the Buyer to respond to a modified or revised Superior Proposal by providing a new written notice to Parent and complying with the requirements of Section 5.3(f) with respect to such new written notice. The Notice Period for any subsequent notice will be shortened from four (4) Business Days to two (2) Business Days.",
        "clause_text": "provided, that in the event of any material revisions to the Superior Proposal, the Company will be required to deliver a new written notice to Parent and to comply with the requirements of this Section 5.3(f) with respect to such new written notice; provided, further, that the Notice Period for any subsequent notice will be shortened from four (4) Business Days to two (2) Business Days;",
        "reference_section": "Section 5.3 (f)"
      }
    },
    "adverse_recommendation_change": {
      "adverse_recommendation_change_superior_proposal_included": {
        "answer": true,
        "clause_text": "if (i) the Company has received a bona fide written Acquisition Proposal from a third party that did not result from a breach of this Section 5.3 and that the Company Board determines in good faith, after consultation with its financial advisor and outside counsel, constitutes a Superior Proposal...then, prior to the time (but not after) the Company Required Vote is obtained, the Company Board may take the following actions: (y) effect a Change of Board Recommendation with respect to such Superior Proposal...",
        "reference_section": "Section 5.3 (f)"
      },
      "adverse_recommendation_change_superior_proposal_explanation": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "adverse_recommendation_change_intervening_event_included": {
        "answer": true,
        "clause_text": "Notwithstanding anything to the contrary contained in this Agreement, prior to the time (but not after) the Company Required Vote is obtained, the Company Board may make a Change of Board Recommendation for an Intervening Event if the Company Board has determined in good faith, after consultation with its outside counsel, that, in light of such Intervening Event...",
        "reference_section": "Section 5.3 (g)"
      },
      "adverse_recommendation_change_intervening_event_explanation": {
        "answer": "The Company Board may make a Change of Board Recommendation for an Intervening Event if the Company Board has determined in good faith, after consultation with its outside counsel, that, in light of such Intervening Event and taking into account the results of any negotiations with Parent as contemplated by subsection (ii) below and any offer from Parent contemplated by subsection (iii) below, that the failure to take such action would reasonably be expected to be inconsistent with the fiduciary duties owed by the directors of the Company to the stockholders of the Company under applicable Law.",
        "clause_text": "The Company Board may make a Change of Board Recommendation for an Intervening Event if the Company Board has determined in good faith, after consultation with its outside counsel, that, in light of such Intervening Event and taking into account the results of any negotiations with Parent as contemplated by subsection (ii) below and any offer from Parent contemplated by subsection (iii) below, that the failure to take such action would reasonably be expected to be inconsistent with the fiduciary duties owed by the directors of the Company to the stockholders of the Company under applicable Law.",
        "reference_section": "Section 5.3 (g)"
      },
      "adverse_recommendation_change_timing": {
        "answer": "The Company must provide prior written notice to Parent at least four (4) Business Days in advance of the Company's intention to take such action with respect to a Superior Proposal, and during this Notice Period, negotiate with Parent in good faith.",
        "clause_text": "the Company has provided prior written notice to Parent, at least four (4) Business Days in advance (the \"Notice Period\"), of the Company's intention to take such action with respect to such Superior Proposal...the Company will, during the Notice Period, negotiate with Parent in good faith (to the extent Parent desires to negotiate) to make such adjustments in the terms and conditions of this Agreement so that such Acquisition Proposal ceases to constitute a Superior Proposal;",
        "reference_section": "Section 5.3 (f)"
      }
    },
    "go_shop": {
      "go_shop_included": {
        "answer": false,
        "clause_text": "Except as otherwise permitted by this Section 5.3, the Company will, and will cause its directors, officers and employees to, and will instruct its other Representatives to: (i) (A) immediately cease and cause to be terminated any solicitation, discussions or negotiations with any Persons that may be ongoing with respect to any Acquisition Proposal...",
        "reference_section": "Section 5.3 (a)"
      },
      "go_shop_explanation": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "buyer_diligence_access": {
      "buyer_diligence_access_included": {
        "answer": true,
        "clause_text": "The Company will provide to Parent in writing any information concerning the Company provided to such other Person which was not previously provided to Parent or the Parent Representatives prior to or substantially concurrently with the time it is provided to such Person.",
        "reference_section": "Section 5.3 (d)"
      },
      "buyer_diligence_access_explanation": {
        "answer": "The Company will provide to Parent in writing any information concerning the Company provided to such other Person which was not previously provided to Parent or the Parent Representatives prior to or substantially concurrently with the time it is provided to such Person.",
        "clause_text": "The Company will provide to Parent in writing any information concerning the Company provided to such other Person which was not previously provided to Parent or the Parent Representatives prior to or substantially concurrently with the time it is provided to such Person.",
        "reference_section": "Section 5.3 (d)"
      }
    },
    "recommendation_change_restriction": {
      "recommendation_change_restriction_included": {
        "answer": true,
        "clause_text": "The Company may not terminate this Agreement pursuant to the foregoing clause (z), and any purported termination pursuant to the foregoing clause (z) will be void and of no force or effect, unless the Company concurrently pays the Breakup Fee in accordance with Section 7.2(b); and provided, further, that the Company Board may not effect a Change of Board Recommendation pursuant to the foregoing clause (y) or terminate this Agreement pursuant to the foregoing clause (z) unless: (i) the Company has provided prior written notice to Parent, at least four (4) Business Days in advance (the 'Notice Period'), of the Company's intention to take such action with respect to such Superior Proposal...",
        "reference_section": "Section 5.3 (f)"
      },
      "recommendation_change_restriction_explanation": {
        "answer": "The agreement imposes procedural and timing-based restrictions on how the Company may change its recommendation.",
        "clause_text": "The Company has provided prior written notice to Parent, at least four (4) Business Days in advance (the \"Notice Period\"), of the Company's intention to take such action with respect to such Superior Proposal...the Company will, during the Notice Period, negotiate with Parent in good faith...",
        "reference_section": "Section 5.3 (f)"
      }
    }
  },
  "best_efforts": {
    "regulatory_efforts": {
      "effort_standard": {
        "answer": "Reasonable Best Efforts",
        "clause_text": "Subject to the terms of this Agreement, the Company and Parent will use their respective reasonable best efforts to (i) take, or cause to be taken, all appropriate action and do, or cause to be done, all things necessary, proper or advisable under applicable Law or otherwise to consummate and make effective the transactions contemplated by this Agreement as promptly as practicable and (ii) obtain from any Governmental Entities any consents, licenses, permits, waivers, approvals, authorizations, confirmations, clearances, certificates, exemptions, registrations or orders required to be obtained by Parent or the Company or any of their respective Subsidiaries...",
        "reference_section": "Section 5.5 (a)"
      },
      "effort_scope": {
        "answer": "RBE for HSR, FAA, DOT, and FCC filings",
        "clause_text": "Subject to the terms of this Agreement, the Company and Parent will use their respective reasonable best efforts to...obtain from any Governmental Entities any consents, licenses, permits, waivers, approvals, authorizations, confirmations, clearances, certificates, exemptions, registrations or orders required...including those in connection with the HSR Act...with the FAA, the DOT under 49 U.S.C. §§ 40109, 41105, and 41110, and the FCC...",
        "reference_section": "Section 5.5 (a)"
      }
    },
    "regulatory_fillings_hsr": {
      "hsr_required": {
        "answer": true,
        "clause_text": "The waiting period applicable to the consummation of the Merger under the HSR Act ... shall have expired or been terminated.",
        "reference_section": "Section 6.1 (b) (i)"
      },
      "hsr_filing_deadline_days": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "hsr_notes": {
        "answer": "Must file under HSR Act as a condition to closing; waiting period must expire or be terminated.",
        "clause_text": "The waiting period applicable to the consummation of the Merger under the HSR Act (and any customary timing agreement with any Governmental Entity to toll, stay, or extend any such waiting period, or to delay or not to consummate the Merger contemplated by this Agreement entered into in connection therewith) shall have expired or been terminated.",
        "reference_section": "Section 6.1 (b) (i)"
      }
    },
    "regulatory_fillings_cfius": {
      "cfius_required": {
        "answer": false,
        "clause_text": "None of the execution, delivery or performance of this Agreement by the Company, the consummation by the Company of the Merger or any other transaction contemplated by this Agreement, or the Company's compliance with any of the provisions of this Agreement will require (with or without notice or lapse of time, or both) any consent, approval, authorization or permit of, or filing or registration with or notification to, any Governmental Entity, other than (a) the filing of the Certificate of Merger as required by the DGCL, (b) compliance with any applicable requirements of the HSR Act and other applicable Competition Laws...",
        "reference_section": "Section 3.5"
      },
      "cfius_filing_deadline_days": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "cfius_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "regulatory_fillings_foreign": {
      "foreign_filling_notes": {
        "answer": "Foreign filings may be required under applicable non-U.S. laws",
        "clause_text": "In furtherance and not in limitation of Section 5.5(a), each party agrees to make any appropriate filings, if necessary or advisable, pursuant to other applicable Competition Laws (other than pursuant to the HSR Act, which filings were made prior to the date of this Agreement) with respect to the Merger as promptly as reasonably practicable.",
        "reference_section": "Section 5.5 (b)"
      },
      "foreign_filling_required": {
        "answer": true,
        "clause_text": "None of the execution, delivery or performance of this Agreement by Parent and Merger Sub... will require... any consent, approval, authorization, confirmation, clearance or permit of, or filing or registration with or notification to, any Governmental Entity, other than... compliance with any applicable requirements of the HSR Act and other applicable Competition Laws...",
        "reference_section": "Section 4.4"
      },
      "foreign_filling_deadline_days": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "divestiture_commitments": {
      "divestiture_required": {
        "answer": true,
        "clause_text": "Neither Parent nor the Company (nor any of their respective Subsidiaries or Affiliates) shall be required to sell, hold separate or otherwise dispose of or conduct their business...if such action would or would reasonably be expected to result in a material adverse effect on Parent and its Subsidiaries.",
        "reference_section": "Section 5.5 (e)"
      },
      "divestiture_cap_target_value": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_target_unit": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_target_basis": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_target_basis_scope": {
        "answer": "Parent",
        "clause_text": "it is understood and agreed that subject to the other provisions of this Section 5.5, the identity of any additional Divestiture Actions shall be determined by Parent in its sole and absolute discretion",
        "reference_section": "Section 5.5 (e)"
      },
      "divestiture_cap_target_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_buyer_value": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_buyer_unit": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_buyer_basis": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "divestiture_cap_buyer_basis_scope": {
        "answer": "Parent",
        "clause_text": "Neither Parent, Merger Sub nor any of their respective stockholders, directors, officers, employees or affiliates, has incurred or will incur on behalf of any member of the Parent Group, any brokerage, finders', financial advisory or similar fee in connection with the transactions contemplated by this Agreement, including the Merger.",
        "reference_section": "Section 4.11"
      },
      "divestiture_cap_buyer_notes": {
        "answer": "Parent is not required to divest any of its businesses if such action would or would reasonably be expected to result in a material adverse effect on Parent and its Subsidiaries after giving effect to the transactions contemplated hereby, taken as a whole.",
        "clause_text": "Notwithstanding anything to the contrary in this Agreement, in connection with the receipt of any necessary license, permit, waiver, approval, authorization or order of a Governmental Entity (including under the HSR Act), neither Parent nor the Company (nor any of their respective Subsidiaries or Affiliates) shall be required to sell, hold separate or otherwise dispose of or conduct their business (or, following the Closing, the combined business) in a specified manner, or agree to sell, hold separate or otherwise dispose of or conduct their business (or, following the Closing, the combined business) in a specified manner, or enter into or agree to enter into a voting trust arrangement, proxy arrangement, \"hold separate\" agreement or arrangement or similar agreement or arrangement with respect to the assets, operations or conduct of their business (or, following the Closing, the combined business) in a specified manner, or permit the sale, holding separate or other disposition of, any assets of Parent, the Company or their respective Subsidiaries or Affiliates (each a \"Divestiture Action\") if such action would or would reasonably be expected to result in a material adverse effect on Parent and its Subsidiaries (including the Company and its Subsidiaries) after giving effect to the transactions contemplated hereby, taken as a whole.",
        "reference_section": "Section 5.5 (e)"
      },
      "divestiture_scope_exclusions": {
        "answer": [],
        "clause_text": "The provided excerpts do not contain any language specifying exclusions from divestiture.",
        "reference_section": "The excerpts provided do not include a specific section addressing divestiture scope exclusions."
      },
      "divestiture_clause_summary": {
        "answer": "Parent is obligated to take Divestiture Actions with respect to certain assets to obtain regulatory approval, but only if such actions do not result in a material adverse effect on Parent and its Subsidiaries.",
        "clause_text": "Neither Parent nor the Company (nor any of their respective Subsidiaries or Affiliates) shall be required to sell, hold separate or otherwise dispose of or conduct their business...if such action would or would reasonably be expected to result in a material adverse effect on Parent and its Subsidiaries...provided, however, that (x) Parent hereby agrees to take the Divestiture Action with respect to any of the assets set forth on Section 5.5(e)(x) of the Parent Disclosure Schedule...",
        "reference_section": "Section 5.5 (e)"
      }
    },
    "litigation_commitments": {
      "litigation_requirement_status": {
        "answer": "Explicit Requirement to Litigate",
        "clause_text": "Without limiting the generality of the foregoing, (A) both Parent and Company (and their respective Subsidiaries and Affiliates) shall contest, defend and appeal any Proceedings brought by a Governmental Entity, whether judicial or administrative, challenging or seeking to restrain or prohibit the consummation of the Merger...",
        "reference_section": "Section 5.5 (b)"
      },
      "litigation_clause_scope": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "required_to_litigate_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "withdrawal_and_timing_controls_withdrawal": {
      "withdrawal_control_type": {
        "answer": "buyer_only",
        "clause_text": "Parent shall, on behalf of the parties hereto, control and lead all communications and strategy relating to obtaining all approvals, consents, waivers, registrations, permits, authorizations and other confirmations from any Governmental Entity or third party necessary, proper or advisable to consummate the Merger.",
        "reference_section": "Section 5.5 (f)"
      },
      "withdrawal_control_type_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "withdrawal_and_timing_controls_timing": {
      "timing_agreement_restriction": {
        "answer": false,
        "clause_text": "The excerpts do not contain any clause that restricts entering into timing agreements under the HSR Act without prior written consent.",
        "reference_section": "Not applicable as the specific clause is not found in the provided excerpts."
      },
      "timing_agreement_restriction_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "remedy_actions_other": {
      "remedy_definitions_provided": {
        "answer": false,
        "clause_text": "The following terms are defined elsewhere in this Agreement, as indicated below: ...",
        "reference_section": "Section 8.5"
      },
      "remedy_definition_text": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "transaction_interference": {
      "restriction_on_other_transactions": {
        "answer": true,
        "clause_text": "Except as otherwise permitted by this Section 5.3, the Company will, and will cause its directors, officers and employees to, and will instruct its other Representatives to: (i) (A) immediately cease and cause to be terminated any solicitation, discussions or negotiations with any Persons that may be ongoing with respect to any Acquisition Proposal...",
        "reference_section": "Section 5.3 (a)"
      },
      "interference_clause_text": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "second_request_certification": {
      "second_request_certification_deadline_specified": {
        "answer": false,
        "clause_text": "The provided excerpts do not contain any specific number of days or exact date tied to Second Request compliance.",
        "reference_section": "Not applicable as no relevant section was found."
      },
      "second_request_certification_certification_timeline_notes": {
        "answer": "as promptly as reasonably practicable",
        "clause_text": "Subject to the terms of this Agreement, the Company and Parent will use their respective reasonable best efforts to (i) take, or cause to be taken, all appropriate action and do, or cause to be done, all things necessary, proper or advisable under applicable Law or otherwise to consummate and make effective the transactions contemplated by this Agreement as promptly as practicable and (ii) obtain from any Governmental Entities any consents, licenses, permits, waivers, approvals, authorizations, confirmations, clearances, certificates, exemptions, registrations or orders required to be obtained by Parent or the Company or any of their respective Subsidiaries, or to avoid any action or proceeding by any Governmental Entity (including those in connection with the HSR Act), in connection with the authorization, execution and delivery of this Agreement and the consummation of the transactions contemplated herein, including the Merger.",
        "reference_section": "Section 5.5 (a)"
      },
      "second_request_certification_responsibility_party": {
        "answer": "Both",
        "clause_text": "Each of Parent, Merger Sub and the Company will (i) cooperate and coordinate with the other in the making of any filings or submissions that are required to be made under any applicable Laws or requested to be made by any Governmental Entity in connection with the transactions contemplated by this Agreement...",
        "reference_section": "Section 5.5 (b)"
      }
    },
    "ftc_warning_letter_handling": {
      "ftc_warning_letter_handling_addressed": {
        "answer": false,
        "clause_text": "Each of Parent, Merger Sub and the Company will (i) cooperate and coordinate with the other in the making of any filings or submissions that are required to be made under any applicable Laws or requested to be made by any Governmental Entity in connection with the transactions contemplated by this Agreement, (ii) supply the other or its outside counsel with any information that may be required or requested by any Governmental Entity in connection with such filings or submissions, (iii) supply any additional information that may be required or requested by the Federal Trade Commission, the Department of Justice or other Governmental Entities in which any such filings or submissions are made as promptly as reasonably practicable, and (iv) use their respective reasonable best efforts to cause the expiration or termination of the applicable waiting periods under any applicable Competition Laws as soon as reasonably practicable following the date of this Agreement (and prior to the Outside Date) (as may be extended pursuant to Section 7.1(e)).",
        "reference_section": "Section 5.5 (b)"
      },
      "ftc_warning_letter_handling_notes": {
        "answer": "Not addressed",
        "clause_text": "",
        "reference_section": ""
      },
      "ftc_warning_letter_handling_effect_on_closing_condition": {
        "answer": "Silent",
        "clause_text": "",
        "reference_section": ""
      },
      "ftc_warning_letter_handling_addressed_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "other_timing_controls": {
      "other_timing_controls_deadlines_specified": {
        "answer": [
          "Company to file proxy statement with SEC no later than 20 business days after the agreement date.",
          "Company Stockholder Meeting to be scheduled no later than 45 days following the Proxy Statement Clearance Date.",
          "Company Stockholder Meeting not to be postponed or adjourned by more than 20 business days in aggregate from the Originally Scheduled Date."
        ],
        "clause_text": "As promptly as reasonably practicable following the date of this Agreement (and in any event no later than twenty (20) Business Days after the date of this Agreement), the Company shall prepare and file with the SEC a proxy statement... provided that the Company Stockholder Meeting shall not be initially scheduled to occur later than forty-five (45) days following the Proxy Statement Clearance Date... in no event shall the Company Stockholder Meeting be postponed or adjourned pursuant to this Section 5.4(b) and Section 5.4(c) by more than twenty (20) Business Days in the aggregate from the Originally Scheduled Date.",
        "reference_section": "Section 5.4 (a) (b) (c)"
      }
    },
    "novel_or_unstructured_regulatory_clauses": {
      "novel_or_unstructured_regulatory_clauses_items": {
        "answer": [
          {
            "summary": "The Company must provide Parent with written notice in advance if it is required by applicable Law to take an action in conflict with Section 5.1, unless Parent provides prior written consent.",
            "section": "ARTICLE 5 COVENANTS > Section 5.1 Conduct of Business by the Company Pending the Closing",
            "review_required": true
          },
          {
            "summary": "Parent shall be deemed to have consented to an IOC Request if no response is received by the Response Deadline.",
            "section": "ARTICLE 5 COVENANTS > Section 5.1 Conduct of Business by the Company Pending the Closing",
            "review_required": true
          },
          {
            "summary": "Parent controls and leads all communications and strategy relating to obtaining approvals from Governmental Entities, but must consult with the Company and consider its views.",
            "section": "ARTICLE 5 COVENANTS > Section 5.5 Appropriate Action; Consents; Filings",
            "review_required": true
          },
          {
            "summary": "Neither Parent nor the Company is required to take any action with respect to its business or operations unless the effectiveness of such action is conditioned upon the Closing.",
            "section": "ARTICLE 5 COVENANTS > Section 5.5 Appropriate Action; Consents; Filings",
            "review_required": true
          }
        ],
        "clause_text": "",
        "reference_section": ""
      }
    },
    "prior_approval_commitment": {
      "prior_approval_commitment_addressed": {
        "answer": false,
        "clause_text": "The Company and Parent will use their respective reasonable best efforts to (i) take, or cause to be taken, all appropriate action and do, or cause to be done, all things necessary, proper or advisable under applicable Law or otherwise to consummate and make effective the transactions contemplated by this Agreement as promptly as practicable and (ii) obtain from any Governmental Entities any consents, licenses, permits, waivers, approvals, authorizations, confirmations, clearances, certificates, exemptions, registrations or orders required to be obtained by Parent or the Company or any of their respective Subsidiaries, or to avoid any action or proceeding by any Governmental Entity (including those in connection with the HSR Act), in connection with the authorization, execution and delivery of this Agreement and the consummation of the transactions contemplated herein, including the Merger.",
        "reference_section": "Section 5.5 (a)"
      },
      "prior_approval_commitment_obligations_summary": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "regulatory_process_control_discretion": {
      "regulatory_process_control_discretion": {
        "answer": "Parent",
        "clause_text": "Parent shall, on behalf of the parties hereto, control and lead all communications and strategy relating to obtaining all approvals, consents, waivers, registrations, permits, authorizations and other confirmations from any Governmental Entity or third party necessary, proper or advisable to consummate the Merger.",
        "reference_section": "Section 5.5 (f)"
      },
      "parent_has_sole_discretion_excluding_remedies": {
        "answer": false,
        "clause_text": "Parent shall, on behalf of the parties hereto, control and lead all communications and strategy relating to obtaining all approvals, consents, waivers, registrations, permits, authorizations and other confirmations from any Governmental Entity or third party necessary, proper or advisable to consummate the Merger and other transactions contemplated by this Agreement and in connection with any investigation or other inquiry or litigation by or before, or any negotiations with, a Governmental Entity; provided, however, that Parent shall consult in advance with the Company and in good faith take the Company's views into account regarding the overall strategic direction of any such litigation or approval process, as applicable, and consult with the Company prior to taking any material substantive positions, making dispositive motions or other material substantive filings or submissions or entering into any negotiations concerning such litigation or approvals, as applicable.",
        "reference_section": "Section 5.5 (f)"
      }
    },
    "no_limitations_on_buyer_remedies": {
      "no_limitations_on_buyer_remedies_value": {
        "answer": false,
        "clause_text": "Notwithstanding anything to the contrary in this Agreement, in connection with the receipt of any necessary license, permit, waiver, approval, authorization or order of a Governmental Entity (including under the HSR Act), neither Parent nor the Company (nor any of their respective Subsidiaries or Affiliates) shall be required to sell, hold separate or otherwise dispose of or conduct their business (or, following the Closing, the combined business) in a specified manner...",
        "reference_section": "Section 5.5 (e)"
      },
      "no_limitations_on_buyer_remedies_inferred_hohw": {
        "answer": false,
        "clause_text": "Notwithstanding anything to the contrary in this Agreement, in connection with the receipt of any necessary license, permit, waiver, approval, authorization or order of a Governmental Entity (including under the HSR Act), neither Parent nor the Company (nor any of their respective Subsidiaries or Affiliates) shall be required to sell, hold separate or otherwise dispose of or conduct their business (or, following the Closing, the combined business) in a specified manner...",
        "reference_section": "Section 5.5 (e)"
      },
      "no_limitations_on_buyer_remedies_explanation": {
        "answer": "Not applicable",
        "clause_text": "",
        "reference_section": ""
      },
      "no_limitations_on_buyer_remedies_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "no_limitations_on_buyer_remedies_inferred_hohw_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "no_limitations_on_buyer_remedies_materiality_basis": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "materiality_definition_text": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "refiling_commitment": {
      "refiling_commitment_required": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "refiling_commitment_required_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "refiling_commitment_max_refiles": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "refiling_commitment_max_refiles_notes": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "refiling_commitment_max_refiles_specification_status": {
        "answer": "Not Specified",
        "clause_text": "The provided excerpts do not mention any limit or explicitly state that refilings are unlimited.",
        "reference_section": "Section 5.5"
      }
    }
  },
  "termination": {
    "outside_date": {
      "primary_date": {
        "answer": "July 28, 2023",
        "clause_text": "By Parent or the Company, if the Effective Time has not occurred on or before July 28, 2023 (the 'Outside Date');",
        "reference_section": "Section 7.1 (e)"
      }
    },
    "extension": {
      "extension_list": {
        "answer": [
          {
            "Extension Length": "6 months",
            "Who Grants the Extension": "automatic",
            "Conditions to Extend": "The condition set forth in Section 6.1(b) (or Section 6.1(c), to the extent related to Section 6.1(b)) has not been satisfied prior to the initial Outside Date, but all other conditions to Closing are satisfied, other than those conditions that by their nature are to be satisfied at the Closing, which conditions shall be capable of being satisfied at such time.",
            "Termination Restrictions Due to Breach": "Yes, the right to terminate this Agreement under Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date."
          },
          {
            "Extension Length": "6 months",
            "Who Grants the Extension": "automatic",
            "Conditions to Extend": "The condition set forth in Section 6.1(b) (or Section 6.1(c), to the extent related to Section 6.1(b)) has not been satisfied prior to the Extended Outside Date, but all other conditions to Closing are satisfied, other than those conditions that by their nature are to be satisfied at the Closing, which conditions shall be capable of being satisfied at such time.",
            "Termination Restrictions Due to Breach": "Yes, the right to terminate this Agreement under Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date."
          },
          {
            "Extension Length": "further extension",
            "Who Grants the Extension": "Company and Parent by mutual written agreement",
            "Conditions to Extend": "No specific conditions other than mutual written agreement.",
            "Termination Restrictions Due to Breach": "Yes, the right to terminate this Agreement under Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date."
          }
        ],
        "clause_text": "provided, however, that the Outside Date shall be automatically extended to January 28, 2024... provided, further, that the Extended Outside Date shall be automatically extended to July 24, 2024... provided, further, that the Company and Parent may agree to further extend the Second Extended Outside Date by mutual written agreement; and provided, further, that the right to terminate this Agreement under this Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date;",
        "reference_section": "Section 7.1"
      }
    },
    "termination_fee": {
      "termination_fee": {
        "answer": "$94.2 million",
        "clause_text": "Breakup Fee means an amount, in cash, equal to $94.2 million.",
        "reference_section": "Section 8.4"
      }
    },
    "reverse_termination_fee": {
      "reverse_termination_fee": {
        "answer": "70,000,000",
        "clause_text": "Parent shall pay the Company a fee in the amount of $70,000,000 (the 'Additional Parent Regulatory Fee') within two (2) Business Days following the date of such termination;",
        "reference_section": "Section 7.2 (e)"
      }
    },
    "reverse_termination_fee_exist": {
      "reverse_termination_fee_exist": {
        "answer": true,
        "clause_text": "Parent shall pay the Company a fee in the amount of $70,000,000 (the 'Additional Parent Regulatory Fee') within two (2) Business Days following the date of such termination; provided, however, that neither the Remaining Parent Regulatory Fee nor the Additional Parent Regulatory Fee shall be payable by Parent pursuant to this Section 7.2(e) if the failure of the conditions set forth in Section 7.1(b) ...",
        "reference_section": "Section 7.2 (e)"
      }
    }
  },
  "ordinary_course": {
    "ordinary_course_covenant": {
      "concise_standard_summary": {
        "answer": "The Company shall conduct its business in the ordinary course consistent with past practice and shall use commercially reasonable efforts to preserve intact its business organization.",
        "clause_text": "Except as otherwise expressly contemplated or required by this Agreement or with the prior written consent of Parent (which consent shall not be unreasonably withheld, conditioned or delayed), during the period from the date of this Agreement until the earlier of the Effective Time or the termination of this Agreement in accordance with Article VIII, the Company shall, and shall cause each of its Subsidiaries to, use its and their respective commercially reasonable efforts to (i) conduct its business in the ordinary course of business consistent with past practice, (ii) preserve intact its business organization, (iii) maintain in effect all of its Permits, (iv) keep available the services of its executive officers and employees and (v) maintain satisfactory relationships with Governmental Entities, customers, suppliers, vendors, lessors and others having material business relationships with it.",
        "reference_section": "Section 5.1 (a)"
      }
    }
  },
  "board_approval": {
    "board_approval": {
      "target_board_approval": {
        "answer": true,
        "clause_text": "WHEREAS, the Board of Directors of the Company (the \"Company Board\") has, upon the terms and subject to the conditions set forth herein, unanimously (i) determined that the Merger and the other transactions contemplated by this Agreement are fair to and in the best interests of the Company and its stockholders, (ii) approved and declared advisable this Agreement, the Merger and the other transactions contemplated hereby in accordance with the requirements of the DGCL and (iii) subject to the terms and conditions of this Agreement, recommended that the stockholders of the Company vote their Shares in favor of the adoption of this Agreement (the \"Company Board Recommendation\");",
        "reference_section": "ARTICLE Preamble"
      },
      "target_board_unanimous": {
        "answer": true,
        "clause_text": "At a meeting duly called and held prior to the execution and delivery of this Agreement, the Company Board adopted resolutions by which the Company Board unanimously (i) determined that the transactions contemplated hereby constitute a Superior Proposal as defined under the Frontier Merger Agreement and that it is in the best interests of the Company and its stockholders to terminate the Frontier Merger Agreement to enter into this Agreement, (ii) determined that the Merger and the other transactions contemplated by this Agreement are fair to and in the best interests of the Company and its stockholders, (iii) approved and declared advisable this Agreement, the Merger and the other transactions contemplated hereby, in accordance with the requirements of the DGCL, and (iv) subject to the terms and conditions of this Agreement, recommended that the stockholders of the Company vote their Shares in favor of adopting this Agreement, and, as of the date hereof, none of the aforesaid resolutions has been amended, rescinded or modified.",
        "reference_section": "Section 3.3"
      },
      "acquirer_board_approval": {
        "answer": true,
        "clause_text": "WHEREAS, the Board of Directors of Parent has duly authorized, approved and adopted the execution, delivery and performance by Parent of this Agreement and the consummation by Parent of the Merger and the other transactions contemplated by this Agreement;",
        "reference_section": "ARTICLE Preamble"
      },
      "acquirer_board_unanimous": {
        "answer": false,
        "clause_text": "WHEREAS, the Board of Directors of Parent has duly authorized, approved and adopted the execution, delivery and performance by Parent of this Agreement and the consummation by Parent of the Merger and the other transactions contemplated by this Agreement;",
        "reference_section": "ARTICLE Preamble"
      }
    }
  },
  "party_details": {
    "acquirer": {
      "acquirer": {
        "answer": "JetBlue Airways Corporation",
        "clause_text": "AGREEMENT AND PLAN OF MERGER, dated as of July 28, 2022 (this \"Agreement\"), is entered into by and among JetBlue Airways Corporation, a Delaware corporation (\"Parent\"), Sundown Acquisition Corp., a Delaware corporation and a direct wholly owned Subsidiary of Parent (\"Merger Sub\"), and Spirit Airlines, Inc., a Delaware corporation (the \"Company\" and together with Parent and Merger Sub, collectively, the \"parties\" and each individually a \"party\").",
        "reference_section": "ARTICLE Preamble"
      },
      "parent_entity_details": {
        "answer": "JetBlue Airways Corporation",
        "clause_text": "AGREEMENT AND PLAN OF MERGER, dated as of July 28, 2022 (this \"Agreement\"), is entered into by and among JetBlue Airways Corporation, a Delaware corporation (\"Parent\"), Sundown Acquisition Corp., a Delaware corporation and a direct wholly owned Subsidiary of Parent (\"Merger Sub\"), and Spirit Airlines, Inc., a Delaware corporation (the \"Company\" and together with Parent and Merger Sub, collectively, the \"parties\" and each individually a \"party\").",
        "reference_section": "ARTICLE Preamble"
      }
    },
    "target": {
      "target": {
        "answer": "Spirit Airlines, Inc.",
        "clause_text": "Spirit Airlines, Inc., a Delaware corporation (the \"Company\" and together with Parent and Merger Sub, collectively, the \"parties\" and each individually a \"party\").",
        "reference_section": "ARTICLE Preamble"
      }
    },
    "subsidiaries": {
      "target_subsidiaries_present": {
        "answer": false,
        "clause_text": "Section 3.1(d) of the Company Disclosure Schedule sets forth each Subsidiary of the Company.",
        "reference_section": "Section 3.1"
      },
      "target_subsidiaries": {
        "answer": "No target subsidiaries explicitly involved in the merger structure are mentioned.",
        "clause_text": "The Company hereby represents and warrants to Parent and Merger Sub as follows: (a) The Company is a corporation duly organized, validly existing and in good standing under the Laws of the State of Delaware.",
        "reference_section": "Section 3.1"
      },
      "acquirer_subsidiaries_present": {
        "answer": true,
        "clause_text": "Merger Sub was formed solely for the purpose of engaging in the transactions contemplated by this Agreement.",
        "reference_section": "Section 4.9"
      },
      "acquirer_subsidiaries": {
        "answer": "[{ \"name\": \"Sundown Acquisition Corp.\", \"clause_reference\": \"ARTICLE 1 – THE MERGER > Section 1.1 – The Merger\", \"role\": \"Wholly owned merger vehicle used to merge with the target\" }]",
        "clause_text": "Upon the terms and subject to the conditions set forth in this Agreement, and in accordance with the DGCL, at the Effective Time, Merger Sub will be merged with and into the Company.",
        "reference_section": "Section 1.1"
      }
    },
    "transaction": {
      "transaction_type": {
        "answer": "Reverse Triangular Merger",
        "clause_text": "WHEREAS, Parent and the Company have determined to engage in a strategic business combination whereby, on the terms and subject to the conditions set forth in this Agreement, Merger Sub will be merged with and into the Company, with the Company continuing as the Surviving Corporation (the 'Merger'), in accordance with the General Corporation Law of the State of Delaware (the 'DGCL');",
        "reference_section": "ARTICLE Preamble"
      },
      "transaction_structure_notes": {
        "answer": "Merger Sub will be merged with and into the Company, with the Company continuing as the Surviving Corporation.",
        "clause_text": "Upon the terms and subject to the conditions set forth in this Agreement, and in accordance with the DGCL, at the Effective Time, Merger Sub will be merged with and into the Company. As a result of the Merger, the separate corporate existence of Merger Sub will cease, and the Company will continue as the surviving corporation of the Merger (the 'Surviving Corporation').",
        "reference_section": "Section 1.1 (a)"
      }
    },
    "merger_sub_details": {
      "merger_sub_details": {
        "answer": "Sundown Acquisition Corp., a Delaware corporation and a direct wholly owned Subsidiary of Parent",
        "clause_text": "Sundown Acquisition Corp., a Delaware corporation and a direct wholly owned Subsidiary of Parent (\"Merger Sub\")",
        "reference_section": "ARTICLE Preamble"
      }
    }
  },
  "closing_mechanics": {
    "target_date": {
      "target_date": {
        "answer": "3 business days after satisfaction or written waiver of all conditions set forth in Article 6",
        "clause_text": "The closing of the Merger (the \"Closing\") will take place at 9:00 a.m., Eastern time, on a date to be specified by the parties (the \"Closing Date\"), such date to be no later than the third Business Day after satisfaction or written waiver of all of the conditions set forth in Article 6...",
        "reference_section": "Section 1.2"
      }
    },
    "marketing_period": {
      "has_marketing_period": {
        "answer": false,
        "clause_text": "The following terms are defined elsewhere in this Agreement, as indicated below: ...",
        "reference_section": "Section 8.5"
      },
      "marketing_period_details": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "inside_date": {
      "has_inside_date": {
        "answer": false,
        "clause_text": "The document sections provided do not mention an 'Inside Date'.",
        "reference_section": "Section 7.1"
      },
      "inside_date_details": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    }
  },
  "specific_performance": {
    "specific_performance": {
      "specific_performance_available": {
        "answer": true,
        "clause_text": "The parties hereto agree that irreparable damage would occur in the event that any of the provisions of this Agreement were not performed in accordance with their specific terms or were otherwise breached. It is accordingly agreed that the parties hereto will be entitled to an injunction or injunctions to prevent breaches of this Agreement and to enforce specifically the terms and provisions hereof in any court referred to in Section 8.12(b), this being in addition to any other remedy to which they are entitled at Law or in equity.",
        "reference_section": "Section 8.14"
      },
      "specific_performance_parties": {
        "answer": "Parent, Merger Sub, Company",
        "clause_text": "The parties hereto agree that irreparable damage would occur in the event that any of the provisions of this Agreement were not performed in accordance with their specific terms or were otherwise breached. It is accordingly agreed that the parties hereto will be entitled to an injunction or injunctions to prevent breaches of this Agreement and to enforce specifically the terms and provisions hereof in any court referred to in Section 8.12(b), this being in addition to any other remedy to which they are entitled at Law or in equity.",
        "reference_section": "Section 8.14"
      },
      "specific_performance_limitations": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "specific_performance_financing_condition": {
        "answer": false,
        "clause_text": "Parent understands and acknowledges that under the terms of this Agreement, the obligations of Parent and Merger Sub to consummate the Merger are not in any way contingent upon or otherwise subject to the consummation by Parent or Merger Sub of any financing arrangements, the obtaining by Parent or Merger Sub of any financing or the availability, grant, provision or extension of any financing to Parent or Merger Sub.",
        "reference_section": "Section 4.7"
      },
      "specific_performance_financing_details": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    }
  },
  "confidentiality_and_clean_room": {
    "confidentiality": {
      "confidentiality_exists": {
        "answer": true,
        "clause_text": "The information referred to in the previous sentence shall be subject to the Confidentiality Agreement, dated as of April 8, 2022, by and between the Company and Parent (the 'Confidentiality Agreement'); provided, that nothing in the Confidentiality Agreement shall restrict Parent's or Merger Sub's ability to take any of the actions expressly contemplated by this Agreement.",
        "reference_section": "Section 5.2"
      },
      "confidentiality_agreement_date": {
        "answer": "April 8, 2022",
        "clause_text": "The information referred to in the previous sentence shall be subject to the Confidentiality Agreement, dated as of April 8, 2022, by and between the Company and Parent (the \"Confidentiality Agreement\");",
        "reference_section": "Section 5.2"
      },
      "confidentiality_obligation_termination_date": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "clean_room": {
      "clean_room_exists": {
        "answer": false,
        "clause_text": "The provided excerpts do not mention a Clean Room or Clean Team arrangement.",
        "reference_section": "confidentiality_and_clean_room > clean_room"
      },
      "clean_room_start_date": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "clean_room_end_date": {
        "answer": "Effective Time",
        "clause_text": "This Agreement may be terminated, and the Merger contemplated hereby may be abandoned by action taken or authorized by the Board of Directors of the terminating party or parties, whether before or after adoption of this Agreement by the stockholders of the Company or of Merger Sub: (a) By mutual written consent of Parent and the Company, by action of their respective Boards of Directors, at any time prior to the Effective Time;",
        "reference_section": "Section 7.1"
      },
      "clean_room_scope_restrictions": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      },
      "clean_room_protection_clause_present": {
        "answer": true,
        "clause_text": "The Company will, and will cause its directors, officers and employees to, and will instruct its other Representatives to: (i) (D) promptly terminate all physical and electronic data room access previously granted to such Person and its Representatives;",
        "reference_section": "Section 5.3 (a) (i)"
      },
      "clean_room_protection_clause_summary": {
        "answer": "The agreement contains provisions that result in the suspension or restriction of the Company's access to clean room or confidential information in connection with a Superior Proposal.",
        "clause_text": "The Company will, and will cause its directors, officers and employees to, and will instruct its other Representatives to: (i) (A) immediately cease and cause to be terminated any solicitation, discussions or negotiations with any Persons that may be ongoing with respect to any Acquisition Proposal... (D) promptly terminate all physical and electronic data room access previously granted to such Person and its Representatives;",
        "reference_section": "Section 5.3 (a)"
      }
    }
  },
  "complex_consideration_and_dividends": {
    "deal_consideration": {
      "deal_consideration_overview": {
        "answer": "$33.50 minus (A) the Approval Prepayment Amount and (B) the lesser of $1.15 and the Aggregate Additional Prepayment Amount",
        "clause_text": "Each share (\"Share\") of Common Stock of the Company, par value $0.0001 per share (\"Company Common Stock\"), issued and outstanding immediately prior to the Effective Time...will be converted into the right to receive...an amount in cash per Share, without interest, equal to (such amount, the \"Merger Consideration\") (i) $33.50 minus (ii) (A) to the extent paid...the Approval Prepayment Amount and (B) the lesser of (1) $1.15 and (2) the Aggregate Additional Prepayment Amount.",
        "reference_section": "Section 2.1"
      },
      "deal_consideration_details": {
        "answer": "$33.50 minus (A) the Approval Prepayment Amount and (B) the lesser of $1.15 and the Aggregate Additional Prepayment Amount",
        "clause_text": "Each share of Common Stock of the Company will be converted into the right to receive an amount in cash per Share, without interest, equal to $33.50 minus (A) the Approval Prepayment Amount and (B) the lesser of $1.15 and the Aggregate Additional Prepayment Amount.",
        "reference_section": "Section 2.1"
      }
    },
    "proration": {
      "proration_exists": {
        "answer": false,
        "clause_text": "The excerpts do not mention any proration mechanism between stock and cash or other types of consideration.",
        "reference_section": "ARTICLE 2 CONVERSION OF SECURITIES"
      },
      "proration_details": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "election": {
      "election_exists": {
        "answer": false,
        "clause_text": "Each share (\"Share\") of Common Stock of the Company, par value $0.0001 per share (\"Company Common Stock\"), issued and outstanding immediately prior to the Effective Time (other than Shares to be cancelled in accordance with Section 2.1(b) and other than Dissenting Shares) will be converted into the right to receive, upon surrender of the Certificate formerly representing such Shares in the case of certificated Shares, or automatically in the case of Book-Entry Shares formerly representing such Shares, in accordance with Section 2.2, an amount in cash per Share, without interest, equal to (such amount, the \"Merger Consideration\") (i) $33.50 minus (ii) (A) to the extent paid (or, in the event that the Closing Date occurs after the Approval Prepayment Record Date but before the Approval Prepayment Date, to the extent payable after the Closing Date), the Approval Prepayment Amount and (B) the lesser of (1) $1.15 and (2) the Aggregate Additional Prepayment Amount.",
        "reference_section": "Section 2.1"
      },
      "election_details": {
        "answer": "No election is permitted and consideration is fixed.",
        "clause_text": "Each share ('Share') of Common Stock of the Company, par value $0.0001 per share ('Company Common Stock'), issued and outstanding immediately prior to the Effective Time ... will be converted into the right to receive ... an amount in cash per Share, without interest, equal to ... the 'Merger Consideration'.",
        "reference_section": "Section 2.1 (a)"
      }
    },
    "cvr": {
      "cvr_exists": {
        "answer": false,
        "clause_text": "The excerpts provided do not contain any reference to a Contingent Value Right (CVR).",
        "reference_section": "The provided sections do not include any specific reference to a CVR."
      },
      "cvr_details": {
        "answer": "NA",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "ticking_fees": {
      "ticking_fees_exists": {
        "answer": true,
        "clause_text": "Subject to the Company Stockholder Approval having been obtained, on or prior to the last Business Day of each calendar month commencing after December 31, 2022, until the earlier of (x) the Closing Date and (y) the termination of the Merger Agreement in accordance with its terms, Parent shall pay or cause to be paid to the holders of record of Outstanding Shares as of a date not more than five (5) Business Days prior to the last Business Day of such month (each such date, an 'Additional Prepayment Record Date'), an amount in cash equal to $0.10 per Share (such amount, the 'Additional Prepayment Amount', each such monthly payment, an 'Additional Prepayment' and the date on which each Additional Prepayment is made, an 'Additional Prepayment Date').",
        "reference_section": "Section 5.18 (c)"
      },
      "ticking_fees_details": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "contingent_payments": {
      "contingent_payments_exists": {
        "answer": true,
        "clause_text": "Parent shall pay directly to the stockholders of the Company as of a record date that is five (5) Business Days following the date of such termination (the 'Remaining Regulatory Fee Record Date') an amount per Share in cash equal to the Remaining Regulatory Fee Per Share Amount and (2) Parent shall pay to the Company an amount equal to the Remaining Regulatory Fee Award Amount.",
        "reference_section": "Section 7.2 (e)"
      },
      "contingent_payments_details": {
        "answer": "The contingent payments include the Approval Prepayment and Additional Prepayments, which are structured as cash payments to holders of Outstanding Shares. The Approval Prepayment is $2.50 per Share, payable within five business days following the Company Stockholder Approval. Additional Prepayments are $0.10 per Share, payable monthly until the earlier of the Closing Date or termination of the Merger Agreement.",
        "clause_text": "Subject to the Company Stockholder Approval being obtained, Parent shall, on or prior to the fifth (5th) Business Day following the date on which the Company Stockholder Approval is obtained, pay or cause to be paid, to the holders of record of Outstanding Shares as of the record date established by the Company for the Company Stockholder Meeting (the 'Approval Prepayment Record Date'), an amount in cash equal to $2.50 per Share (such amount, the 'Approval Prepayment Amount', such payment, the 'Approval Prepayment' and such date on which the Approval Prepayment is made, the 'Approval Prepayment Date').",
        "reference_section": "Section 5.18 (a)"
      }
    },
    "company_dividends": {
      "company_dividends_can_pay": {
        "answer": false,
        "clause_text": "Company Treasury Restrictions means the restrictions and limitations that the Company has been, and will continue to be, subject to as a result of the Company’s participation in the PSP, PSP2 and PSP3, including, but not limited to, the: (ii) prohibition on the payment of dividends until September 30, 2022.",
        "reference_section": "Section 8.4"
      },
      "company_dividends_details": {
        "answer": "The dividend structure involves cash payments to holders of Outstanding Shares, with an Approval Prepayment Amount of $2.50 per Share and Additional Prepayment Amounts of $0.10 per Share monthly. These payments are subject to Company Stockholder Approval and are made on specified dates relative to the Approval Prepayment Date and the end of each calendar month.",
        "clause_text": "Subject to the Company Stockholder Approval being obtained, Parent shall, on or prior to the fifth (5th) Business Day following the date on which the Company Stockholder Approval is obtained, pay or cause to be paid, to the holders of record of Outstanding Shares as of the record date established by the Company for the Company Stockholder Meeting (the 'Approval Prepayment Record Date'), an amount in cash equal to $2.50 per Share (such amount, the 'Approval Prepayment Amount', such payment, the 'Approval Prepayment' and such date on which the Approval Prepayment is made, the 'Approval Prepayment Date').",
        "reference_section": "Section 5.18 (a)"
      }
    },
    "parent_dividends": {
      "parent_dividends_can_pay": {
        "answer": true,
        "clause_text": "Subject to the Company Stockholder Approval having been obtained, on or prior to the last Business Day of each calendar month commencing after December 31, 2022, until the earlier of (x) the Closing Date and (y) the termination of the Merger Agreement in accordance with its terms, Parent shall pay or cause to be paid to the holders of record of Outstanding Shares as of a date not more than five (5) Business Days prior to the last Business Day of such month an amount in cash equal to $0.10 per Share.",
        "reference_section": "Section 5.18 (c)"
      },
      "parent_dividends_details": {
        "answer": "The Parent is required to make specific cash payments to holders of Outstanding Shares, subject to Company Stockholder Approval. An initial payment of $2.50 per Share is to be made within five business days following stockholder approval. Additionally, monthly payments of $0.10 per Share are to be made until the earlier of the Closing Date or termination of the Merger Agreement. These payments are subject to tax indemnification provisions.",
        "clause_text": "Subject to the Company Stockholder Approval being obtained, Parent shall, on or prior to the fifth (5th) Business Day following the date on which the Company Stockholder Approval is obtained, pay or cause to be paid, to the holders of record of Outstanding Shares as of the record date established by the Company for the Company Stockholder Meeting (the 'Approval Prepayment Record Date'), an amount in cash equal to $2.50 per Share...",
        "reference_section": "Section 5.18 (a)"
      }
    },
    "collar": {
      "collar_exists": {
        "answer": false,
        "clause_text": "Notwithstanding the foregoing, if between the date of this Agreement and the Effective Time the outstanding shares of Company Common Stock shall have been changed into a different number of shares or a different class by reason of any reclassification, stock split (including a reverse stock split), recapitalization, split-up, combination, exchange of shares, readjustment, or other similar transaction, or a stock dividend or stock distribution thereon shall be declared with a record date within said period, the Merger Consideration, the Approval Prepayment Amount, any Additional Prepayment Amount and any other similarly dependent items, as the case may be, shall be equitably adjusted to provide the holders of Company Common Stock the same economic effect as contemplated by this Agreement prior to such event.",
        "reference_section": "Section 2.6"
      },
      "collar_details": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "exchange_ratio_adjustment": {
      "exchange_ratio_adjustment_exists": {
        "answer": true,
        "clause_text": "Notwithstanding the foregoing, if between the date of this Agreement and the Effective Time the outstanding shares of Company Common Stock shall have been changed into a different number of shares or a different class by reason of any reclassification, stock split (including a reverse stock split), recapitalization, split-up, combination, exchange of shares, readjustment, or other similar transaction, or a stock dividend or stock distribution thereon shall be declared with a record date within said period, the Merger Consideration, the Approval Prepayment Amount, any Additional Prepayment Amount and any other similarly dependent items, as the case may be, shall be equitably adjusted to provide the holders of Company Common Stock the same economic effect as contemplated by this Agreement prior to such event.",
        "reference_section": "Section 2.6"
      },
      "exchange_ratio_adjustment": {
        "answer": "The exchange ratio adjustment mechanism is based on equitable adjustments to maintain the same economic effect for holders of Company Common Stock in the event of changes such as reclassification, stock split, recapitalization, or similar transactions.",
        "clause_text": "Notwithstanding the foregoing, if between the date of this Agreement and the Effective Time the outstanding shares of Company Common Stock shall have been changed into a different number of shares or a different class by reason of any reclassification, stock split (including a reverse stock split), recapitalization, split-up, combination, exchange of shares, readjustment, or other similar transaction, or a stock dividend or stock distribution thereon shall be declared with a record date within said period, the Merger Consideration, the Approval Prepayment Amount, any Additional Prepayment Amount and any other similarly dependent items, as the case may be, shall be equitably adjusted to provide the holders of Company Common Stock the same economic effect as contemplated by this Agreement prior to such event.",
        "reference_section": "Section 2.6"
      }
    },
    "dividend_adjustment_mechanism": {
      "dividend_adjustment_mechanism_exists": {
        "answer": true,
        "clause_text": "Notwithstanding the foregoing, if between the date of this Agreement and the Effective Time the outstanding shares of Company Common Stock shall have been changed into a different number of shares or a different class by reason of any reclassification, stock split (including a reverse stock split), recapitalization, split-up, combination, exchange of shares, readjustment, or other similar transaction, or a stock dividend or stock distribution thereon shall be declared with a record date within said period, the Merger Consideration, the Approval Prepayment Amount, any Additional Prepayment Amount and any other similarly dependent items, as the case may be, shall be equitably adjusted to provide the holders of Company Common Stock the same economic effect as contemplated by this Agreement prior to such event.",
        "reference_section": "Section 2.6"
      },
      "dividend_adjustment_mechanism": {
        "answer": "The merger consideration will be equitably adjusted if a stock dividend or stock distribution is declared with a record date between the date of the agreement and the effective time.",
        "clause_text": "Notwithstanding the foregoing, if between the date of this Agreement and the Effective Time...or a stock dividend or stock distribution thereon shall be declared with a record date within said period, the Merger Consideration...shall be equitably adjusted to provide the holders of Company Common Stock the same economic effect as contemplated by this Agreement prior to such event.",
        "reference_section": "Section 2.6"
      }
    }
  },
  "law_and_jurisdiction": {
    "governing_law": {
      "governing_law_exists": {
        "answer": true,
        "clause_text": "This Agreement will be governed by, and construed in accordance with, the Laws of the State of Delaware... any action... against any Financing Source Parties... shall be governed by, and construed in accordance with, the laws of the State of New York...",
        "reference_section": "Section 8.12 (a)"
      },
      "governing_law_jurisdiction": {
        "answer": "Delaware",
        "clause_text": "This Agreement will be governed by, and construed in accordance with, the Laws of the State of Delaware, without regard to laws that may be applicable under conflicts of laws principles (whether of the State of Delaware or any other jurisdiction) that would cause the application of the Laws of any jurisdiction other than the State of Delaware.",
        "reference_section": "Section 8.12 (a)"
      }
    },
    "mae_interpretation_jurisdiction": {
      "mae_interpretation_jurisdiction_exists": {
        "answer": false,
        "clause_text": "Company Material Adverse Effect means any change, event, circumstance, development, condition, occurrence or effect that (a) has had, or would reasonably be expected to have, individually or in the aggregate, a material adverse effect on the business, financial condition, assets, liabilities or results of operations of the Company Group, taken as a whole...",
        "reference_section": "Section 8.4"
      },
      "mae_interpretation_jurisdiction": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "financing_jurisdiction": {
      "financing_jurisdiction_exists": {
        "answer": true,
        "clause_text": "Notwithstanding anything herein to the contrary, each of the parties hereto agrees (v) that any action of any kind or nature, whether at law or equity, in contract, in tort or otherwise, against a Financing Source in connection with this Agreement, the Debt Financing or the transactions contemplated hereby or thereby shall be subject to the exclusive jurisdiction of any state or federal court sitting in the Borough of Manhattan, New York, New York and any appellate court thereof...",
        "reference_section": "Section 8.12 (b)"
      },
      "financing_jurisdiction": {
        "answer": "New York",
        "clause_text": "Notwithstanding the foregoing, each party agrees that any action, cause of action, claim, cross-claim or third-party claim of any kind or description, whether in law or in equity, whether in contract or in tort or otherwise, against any Financing Source Parties in any way relating to this Agreement or any of the transactions contemplated by this Agreement, including any dispute arising out of or relating in any way to the Debt Financing, Debt Commitment Letter or the transactions contemplated thereby or the performance thereof, shall be governed by, and construed in accordance with, the laws of the State of New York, without giving effect to any choice of Law or conflict of Laws provision or rule (whether of the State of New York or any other jurisdiction) that would cause the application of the Laws of any jurisdiction other than the State of New York.",
        "reference_section": "Section 8.12 (a)"
      }
    },
    "arbitration_clause": {
      "arbitration_clause_exists": {
        "answer": false,
        "clause_text": "Each of the parties hereto hereby irrevocably and unconditionally submits, for itself and its property, to the exclusive jurisdiction of the Court of Chancery of the State of Delaware...",
        "reference_section": "Section 8.12 (b)"
      },
      "arbitration_clause": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    }
  },
  "financing": {
    "committed_financing": {
      "committed_financing_present": {
        "answer": true,
        "clause_text": "Debt Commitment Letter means the debt commitment letter, dated as of the date hereof, between Parent and Goldman Sachs Bank USA (“GS Bank”), Bank of America BofA Securities, Inc. (or any of its designated affiliates, “BofA Securities”), Bank of America, N.A. (“Bank of America”), BNP Paribas (“BNPP”), Credit Suisse AG, New York Branch (acting through such of its affiliates or branches as it deems necessary, “CS”), Credit Suisse Loan Funding LLC (“CSLF” and, together with CS, “Credit Suisse”), Credit Agricole Corporate and Investment Bank (“CACIB”), Natixis, New York Branch (“Natixis”), Sumitomo Mitsui Banking Corporation (“SMBC”) and MUFG Bank, Ltd. (“MUFG” and, together with GS Bank, BofA Securities, Bank of America, BNPP, Credit Suisse, CACIB, Natixis and SMBC, the “Debt Commitment Parties”), as modified, amended, supplemented, restated, assigned, substituted or replaced in compliance with this Agreement or as required by Section 5.15 following a Financing Failure Event pursuant to which the financial institutions party thereto have agreed, subject only to the applicable Financing Conditions, to provide or cause to be provided the debt financing set forth therein for the purposes of financing the transactions contemplated hereby, the repayment or refinancing of the Company’s existing indebtedness, the payment of fees and expenses and the other transactions, in each case contemplated hereby.",
        "reference_section": "Section 8.4"
      },
      "committed_financing_summary": {
        "answer": "The committed financing arrangements include a Debt Financing provided by a group of financial institutions, including Goldman Sachs Bank USA, Bank of America, BNP Paribas, Credit Suisse, Credit Agricole Corporate and Investment Bank, Natixis, Sumitomo Mitsui Banking Corporation, and MUFG Bank, Ltd. The Debt Commitment Letter outlines the terms of this financing.",
        "clause_text": "Debt Commitment Letter means the debt commitment letter, dated as of the date hereof, between Parent and Goldman Sachs Bank USA (“GS Bank”), Bank of America BofA Securities, Inc. (or any of its designated affiliates, “BofA Securities”), Bank of America, N.A. (“Bank of America”), BNP Paribas (“BNPP”), Credit Suisse AG, New York Branch (acting through such of its affiliates or branches as it deems necessary, “CS”), Credit Suisse Loan Funding LLC (“CSLF” and, together with CS, “Credit Suisse”), Credit Agricole Corporate and Investment Bank (“CACIB”), Natixis, New York Branch (“Natixis”), Sumitomo Mitsui Banking Corporation (“SMBC”) and MUFG Bank, Ltd. (“MUFG” and, together with GS Bank, BofA Securities, Bank of America, BNPP, Credit Suisse, CACIB, Natixis and SMBC, the “Debt Commitment Parties”), as modified, amended, supplemented, restated, assigned, substituted or replaced in compliance with this Agreement or as required by Section 5.15 following a Financing Failure Event pursuant to which the financial institutions party thereto have agreed, subject only to the applicable Financing Conditions, to provide or cause to be provided the debt financing set forth therein for the purposes of financing the transactions contemplated hereby, the repayment or refinancing of the Company’s existing indebtedness, the payment of fees and expenses and the other transactions, in each case contemplated hereby.",
        "reference_section": "Section 8.4"
      }
    },
    "financing_efforts_summary": {
      "financing_efforts_summary": {
        "answer": "Parent is obligated to use reasonable best efforts to arrange and consummate the Debt Financing necessary for the transaction, including maintaining the Debt Commitment Letter, satisfying Financing Conditions, and obtaining alternative financing if needed.",
        "clause_text": "Parent shall, to the extent the proceeds thereof are required to consummate the transactions contemplated hereby, use reasonable best efforts to take, or cause to be taken, all actions and do, or cause to be done, all things necessary or advisable to arrange the Debt Financing and to consummate the Debt Financing on the Closing Date.",
        "reference_section": "Section 5.17 (a)"
      }
    },
    "substitute_financing_notice_and_efforts": {
      "substitute_financing_notice_and_efforts": {
        "answer": "The acquirer is required to notify the company if financing becomes unavailable.",
        "clause_text": "Without limiting Parent's other obligations under Section 5.17(a), if a Financing Failure Event occurs, Parent shall (i) promptly notify the Company of such Financing Failure Event and the reasons therefor, (ii) use reasonable best efforts to obtain alternative financing...",
        "reference_section": "Section 5.17 (b)"
      }
    }
  },
  "proxy_statement": {
    "proxy_statement_filing_timing": {
      "proxy_statement_filing_timing": {
        "answer": "As promptly as reasonably practicable following the date of this Agreement (and in any event no later than twenty (20) Business Days after the date of this Agreement)",
        "clause_text": "As promptly as reasonably practicable following the date of this Agreement (and in any event no later than twenty (20) Business Days after the date of this Agreement), the Company shall prepare and file with the SEC a proxy statement in preliminary form relating to the Company Stockholder Meeting.",
        "reference_section": "Section 5.4 (a)"
      }
    },
    "f4_effectiveness": {
      "f4_effectiveness_efforts": {
        "answer": "reasonable best efforts",
        "clause_text": "The Company and Parent will cooperate and use their respective reasonable best efforts to cause the delisting of the shares of Company Common Stock from the NYSE and the deregistration of such shares as promptly as practicable following the Effective Time in compliance with applicable Law.",
        "reference_section": "Section 5.13"
      },
      "f4_effectiveness_target_date": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "shareholder_meeting": {
      "shareholder_meeting_timing": {
        "answer": "The Company Stockholder Meeting is expected to occur as soon as reasonably practicable after the Proxy Statement Clearance Date, but not later than forty-five (45) days following the Proxy Statement Clearance Date.",
        "clause_text": "The Company shall duly establish a record date for and duly call, give notice of and hold a meeting of its stockholders (the \"Company Stockholder Meeting\") as soon as reasonably practicable after the Proxy Statement Clearance Date for the purpose of voting on the adoption of this Agreement, provided that the Company Stockholder Meeting shall not be initially scheduled to occur later than forty-five (45) days following the Proxy Statement Clearance Date.",
        "reference_section": "Section 5.4 (b)"
      },
      "shareholder_meeting_deadline": {
        "answer": "45 days",
        "clause_text": "The Company Stockholder Meeting shall not be initially scheduled to occur later than forty-five (45) days following the Proxy Statement Clearance Date.",
        "reference_section": "Section 5.4 (b)"
      },
      "shareholder_vote_efforts": {
        "answer": "reasonable best efforts",
        "clause_text": "Subject to the provisions of Section 5.3, the Company will use its reasonable best efforts to solicit from its stockholders proxies in favor of the adoption of this Agreement, and to take all other actions necessary or advisable to secure the Company Stockholder Approval.",
        "reference_section": "Section 5.4 (c)"
      }
    },
    "quorum_or_vote_failure": {
      "quorum_or_vote_failure_handling": {
        "answer": "If the meeting fails to reach quorum or shareholder approval, the Company may adjourn or postpone the meeting under certain conditions, such as lack of quorum or insufficient proxies for approval. The meeting cannot be postponed or adjourned for more than twenty business days in total from the originally scheduled date without Parent's consent.",
        "clause_text": "The Company may postpone or adjourn the Company Stockholder Meeting (i) with the prior written consent of Parent, which consent shall not be unreasonably withheld, conditioned or delayed; (ii) if a quorum has not been established; (iii) to allow reasonable additional time for the filing and mailing of any supplemental or amended disclosure...",
        "reference_section": "Section 5.4 (b)"
      },
      "quorum_or_vote_failure_deadline": {
        "answer": "The Company Stockholder Meeting shall not be postponed or adjourned by more than twenty (20) Business Days in the aggregate from the Originally Scheduled Date.",
        "clause_text": "provided, further, that in no event shall the Company Stockholder Meeting be postponed or adjourned pursuant to this Section 5.4(b) and Section 5.4(c) by more than twenty (20) Business Days in the aggregate from the Originally Scheduled Date.",
        "reference_section": "Section 5.4 (b)"
      }
    },
    "proxy_summary_notes": {
      "proxy_summary_notes": {
        "answer": "The Company must prepare and file a preliminary proxy statement with the SEC within 20 business days of the agreement date, and the Company Stockholder Meeting must be held no later than 45 days after the Proxy Statement Clearance Date. The Company cannot adjourn or postpone the meeting without Parent's consent, except under specific conditions.",
        "clause_text": "As promptly as reasonably practicable following the date of this Agreement (and in any event no later than twenty (20) Business Days after the date of this Agreement), the Company shall prepare and file with the SEC a proxy statement in preliminary form... the Company Stockholder Meeting shall not be initially scheduled to occur later than forty-five (45) days following the Proxy Statement Clearance Date.",
        "reference_section": "Section 5.4 (a) (b)"
      }
    }
  },
  "timeline": {
    "agreement_signing_date": {
      "agreement_signing_date": {
        "answer": "July 28, 2022",
        "clause_text": "AGREEMENT AND PLAN OF MERGER THIS AGREEMENT AND PLAN OF MERGER, dated as of July 28, 2022 (this \"Agreement\"), is entered into by and among JetBlue Airways Corporation, a Delaware corporation (\"Parent\"), Sundown Acquisition Corp., a Delaware corporation and a direct wholly owned Subsidiary of Parent (\"Merger Sub\"), and Spirit Airlines, Inc., a Delaware corporation (the \"Company\" and together with Parent and Merger Sub, collectively, the \"parties\" and each individually a \"party\").",
        "reference_section": "ARTICLE Preamble"
      }
    },
    "confidentiality_agreement_signing_date": {
      "confidentiality_agreement_signing_date": {
        "answer": "April 8, 2022",
        "clause_text": "The information referred to in the previous sentence shall be subject to the Confidentiality Agreement, dated as of April 8, 2022, by and between the Company and Parent (the \"Confidentiality Agreement\");",
        "reference_section": "Section 5.2"
      }
    },
    "announcement_date": {
      "announcement_date": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "proxy_filing_deadline": {
      "proxy_filing_deadline": {
        "answer": "As promptly as reasonably practicable following the date of this Agreement (and in any event no later than twenty (20) Business Days after the date of this Agreement)",
        "clause_text": "As promptly as reasonably practicable following the date of this Agreement (and in any event no later than twenty (20) Business Days after the date of this Agreement), the Company shall prepare and file with the SEC a proxy statement in preliminary form relating to the Company Stockholder Meeting.",
        "reference_section": "Section 5.4 (a)"
      }
    },
    "shareholder_vote_deadline": {
      "shareholder_vote_deadline": {
        "answer": "45 days following the Proxy Statement Clearance Date",
        "clause_text": "The Company Stockholder Meeting shall not be initially scheduled to occur later than forty-five (45) days following the Proxy Statement Clearance Date.",
        "reference_section": "Section 5.4 (b)"
      }
    },
    "outside_date": {
      "outside_date": {
        "answer": "July 28, 2023",
        "clause_text": "By Parent or the Company, if the Effective Time has not occurred on or before July 28, 2023 (the \"Outside Date\"); provided, however, that the Outside Date shall be automatically extended to January 28, 2024...",
        "reference_section": "Section 7.1 (e)"
      },
      "outside_date_extension_list": {
        "answer": [
          {
            "Extension Length": "6 months",
            "Who Grants the Extension": "automatic",
            "Conditions to Extend": "The condition set forth in Section 6.1(b) (or Section 6.1(c), to the extent related to Section 6.1(b)) has not been satisfied prior to the initial Outside Date, but all other conditions to Closing are satisfied, other than those conditions that by their nature are to be satisfied at the Closing, which conditions shall be capable of being satisfied at such time.",
            "Termination Restrictions Due to Breach": "Yes, the right to terminate this Agreement under this Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date."
          },
          {
            "Extension Length": "6 months",
            "Who Grants the Extension": "automatic",
            "Conditions to Extend": "The condition set forth in Section 6.1(b) (or Section 6.1(c), to the extent related to Section 6.1(b)) has not been satisfied prior to the Extended Outside Date, but all other conditions to Closing are satisfied, other than those conditions that by their nature are to be satisfied at the Closing, which conditions shall be capable of being satisfied at such time.",
            "Termination Restrictions Due to Breach": "Yes, the right to terminate this Agreement under this Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date."
          },
          {
            "Extension Length": "further extension",
            "Who Grants the Extension": "Company and Parent by mutual written agreement",
            "Conditions to Extend": "No specific conditions mentioned other than mutual written agreement.",
            "Termination Restrictions Due to Breach": "Yes, the right to terminate this Agreement under this Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date."
          }
        ],
        "clause_text": "provided, however, that the Outside Date shall be automatically extended to January 28, 2024... provided, further, that the Extended Outside Date shall be automatically extended to July 24, 2024... provided, further, that the Company and Parent may agree to further extend the Second Extended Outside Date by mutual written agreement; and provided, further, that the right to terminate this Agreement under this Section 7.1(e) shall not be available to any party whose failure to fulfill any agreements or covenants under this Agreement has been the principal cause of, or resulted in, the failure of the Effective Time to occur on or before such date;",
        "reference_section": "Section 7.1 (e)"
      }
    },
    "hsr_filing_deadline": {
      "hsr_filing_deadline": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "second_request_deadline": {
      "second_request_deadline": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "cfius_filing_deadline": {
      "cfius_filing_deadline": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "marketing_period_dates": {
      "marketing_period_dates": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "inside_date": {
      "inside_date": {
        "answer": "Not found",
        "clause_text": "",
        "reference_section": ""
      }
    },
    "closing_date": {
      "closing_date": {
        "answer": "third Business Day after satisfaction or written waiver of all of the conditions set forth in Article 6",
        "clause_text": "The closing of the Merger (the \"Closing\") will take place at 9:00 a.m., Eastern time, on a date to be specified by the parties (the \"Closing Date\"), such date to be no later than the third Business Day after satisfaction or written waiver of all of the conditions set forth in Article 6 (other than those conditions that by their nature are to be satisfied at the Closing, but subject to the fulfillment or written waiver of those conditions at the Closing), at the offices of Shearman & Sterling LLP, 599 Lexington Avenue, New York, NY 10022, unless another time, date or place is agreed to by the parties hereto.",
        "reference_section": "Section 1.2"
      }
    },
    "conditions_satisfaction_end_date": {
      "conditions_satisfaction_end_date": {
        "answer": "July 28, 2023",
        "clause_text": "By Parent or the Company, if the Effective Time has not occurred on or before July 28, 2023 (the \"Outside Date\"); provided, however, that the Outside Date shall be automatically extended to January 28, 2024 (as so extended, the \"Extended Outside Date\") if the condition set forth in Section 6.1(b) (or Section 6.1(c), to the extent related to Section 6.1(b)) has not been satisfied prior to the initial Outside Date (but all other conditions to Closing are satisfied, other than those conditions that by their nature are to be satisfied at the Closing, which conditions shall be capable of being satisfied at such time); provided, further, that the Extended Outside Date shall be automatically extended to July 24, 2024 (as so extended, the \"Second Extended Outside Date\"), if the condition set forth in Section 6.1(b) (or Section 6.1(c), to the extent related to Section 6.1(b)) has not been satisfied prior to the Extended Outside Date (but all other conditions to Closing are satisfied, other than those conditions that by their nature are to be satisfied at the Closing, which conditions shall be capable of being satisfied at such time); provided, further, that the Company and Parent may agree to further extend the Second Extended Outside Date by mutual written agreement;",
        "reference_section": "Section 7.1"
      }
    }
  }
}